{"SPDXID":"SPDXRef-DOCUMENT","spdxVersion":"SPDX-2.3","creationInfo":{"created":"2025-09-12T10:18:49Z","creators":["Organization: NXP","Tool: Black Duck Hub - 2025.4.1"],"licenseListVersion":"3.20"},"name":"eiq-olive-0.5","dataLicense":"CC0-1.0","hasExtractedLicensingInfos":[{"licenseId":"LicenseRef-3eca8fb9-fca4-4b49-b4bd-189ba8efd691","extractedText":"END-USER LICENSE AGREEMENT FOR ACME SOFTWARE\n============================================\n\nIMPORTANT READ CAREFULLY: This ACME End-User License Agreement (\"EULA\") is a\nlegal agreement between you (either an individual or a single entity) and ACME\nCorporation for the ACME software product identified above, which includes\ncomputer software and may include associated media, printed materials, and\n\"online\" or electronic documentation (\"SOFTWARE PRODUCT\"). The SOFTWARE PRODUCT\nalso includes any updates and supplements to the original SOFTWARE PRODUCT\nprovided to you by ACME. Any software provided along with the SOFTWARE PRODUCT\nthat is associated with a separate end-user license agreement is licensed to you\nunder the terms of that license agreement. By installing, copying, downloading,\naccessing, or otherwise using the SOFTWARE PRODUCT, you agree to be bound by the\nterms of this EULA. If you do not agree to the terms of this EULA, do not install\nor use the SOFTWARE PRODUCT; you may, however, return it to your place of\npurchase for a full refund.\n\n\nSOFTWARE PRODUCT LICENSE\n------------------------\n\nThe SOFTWARE PRODUCT is protected by copyright laws and international copyright\ntreaties, as well as other intellectual property laws and treaties. The SOFTWARE\nPRODUCT is licensed, not sold.\n\n  1. GRANT OF LICENSE. This EULA grants you the following rights:\n\n      * Applications Software. You may install, use, access, display, run, or\n        otherwise interact with (\"RUN\") one copy of the SOFTWARE PRODUCT, or any\n        prior version for the same operating system, on a single computer,\n        workstation, terminal, handheld PC, pager, \"smart phone,\" or other\n        digital electronic device (\"COMPUTER\"). The primary user of the COMPUTER\n        on which the SOFTWARE PRODUCT is installed may make a second copy for his\n        or her exclusive use on a portable computer.\n\n      * Reservation of Rights. All rights not expressly granted are reserved by\n        ACME.\n\n  2. DESCRIPTION OF OTHER RIGHTS AND LIMITATIONS.\n\n      * Not for Resale Software. If the SOFTWARE PRODUCT is labeled \"Not For\n        Resale\" or \"NFR,\" then, notwithstanding other sections of this EULA, your\n        use of the SOFTWARE PRODUCT is limited to use for demonstration, test, or\n        evaluation purposes and you may not resell, or otherwise transfer for\n        value, the SOFTWARE PRODUCT.\n\n      * Limitations on Reverse Engineering, Decompilation, and Disassembly. You\n        may not reverse engineer, decompile, or disassemble the SOFTWARE PRODUCT,\n        except and only to the extent that such activity is expressly permitted\n        by applicable law.\n\n      * Separation of Components. The SOFTWARE PRODUCT is licensed as a single\n        product. Its component parts may not be separated for use on more than\n        one COMPUTER.\n\n      * Trademarks. This EULA does not grant you any rights in connection with\n        any trademarks or service marks of ACME.\n\n      * Rental. You may not rent, lease, or lend the SOFTWARE PRODUCT.\n\n      * Support Services. ACME may provide you with support services related to\n        the SOFTWARE PRODUCT (\"Support Services\"). Use of Support Services is\n        governed by the ACME policies and programs described in the user manual,\n        in \"online\" documentation, and/or in other ACME-provided materials. Any\n        supplemental software code provided to you as part of the Support\n        Services shall be considered part of the SOFTWARE PRODUCT and subject to\n        the terms and conditions of this EULA.\n\n      * Software Transfer. The initial licensee of the SOFTWARE PRODUCT may make\n        a one-time permanent transfer of this EULA and SOFTWARE PRODUCT only\n        directly to an end user. This transfer must include all of the SOFTWARE\n        PRODUCT (including all component parts, the media and printed materials,\n        any upgrades, this EULA, and, if applicable, the Certificate of\n        Authenticity). Such transfer may not be by way of consignment or any\n        other indirect transfer. The transferee of such one-time transfer must\n        agree to comply with the terms of this EULA, including the obligation not\n        to further transfer this EULA and SOFTWARE PRODUCT.\n\n      * Termination. Without prejudice to any other rights, ACME may terminate\n        this EULA if you fail to comply with the terms and conditions of this\n        EULA. In such event, you must destroy all copies of the SOFTWARE PRODUCT\n        and all of its component parts.\n\n  3. COPYRIGHT. All title and copyrights in and to the SOFTWARE PRODUCT\n    (including but not limited to any images, photographs, animations, video,\n    audio, music, text, and \"applets\" incorporated into the SOFTWARE PRODUCT),\n    the accompanying printed materials, and any copies of the SOFTWARE PRODUCT\n    are owned by ACME or its suppliers. All title and intellectual property\n    rights in and to the content that may be accessed through use of the SOFTWARE\n    PRODUCT is the property of the respective content owner and may be protected\n    by applicable copyright or other intellectual property laws and treaties.\n    This EULA grants you no rights to use such content. If this SOFTWARE PRODUCT\n    contains documentation that is provided only in electronic form, you may\n    print one copy of such electronic documentation. You may not copy the printed\n    materials accompanying the SOFTWARE PRODUCT.\n\n  4. BACKUP COPY. After installation of one copy of the SOFTWARE PRODUCT pursuant\n    to this EULA, you may keep the original media on which the SOFTWARE PRODUCT\n    was provided by ACME solely for backup or archival purposes. If the original\n    media is required to use the SOFTWARE PRODUCT on the COMPUTER, you may make\n    one copy of the SOFTWARE PRODUCT solely for backup or archival purposes.\n    Except as expressly provided in this EULA, you may not otherwise make copies\n    of the SOFTWARE PRODUCT or the printed materials accompanying the SOFTWARE\n    PRODUCT.\n\n  5. U.S. GOVERNMENT RESTRICTED RIGHTS. All SOFTWARE PRODUCT provided to the U.S.\n    Government pursuant to solicitations issued on or after December 1, 1995 is\n    provided with the commercial rights and restrictions described elsewhere\n    herein. All SOFTWARE PRODUCT provided to the U.S. Government pursuant to\n    solicitations issued prior to December 1, 1995 is provided with RESTRICTED\n    RIGHTS as provided for in FAR, 48 CFR 52.227-14 (JUNE 1987) or FAR, 48 CFR\n    252.227-7013 (OCT 1988), as applicable.\n\n  6. EXPORT RESTRICTIONS. This SOFTWARE PRODUCT has been classified by the US\n    Government as exportable under License Exception TSU. Therefore the following\n    terms apply: You agree that you will not export or re-export the SOFTWARE\n    PRODUCT, any part thereof, or any process or service that is the direct\n    product of the SOFTWARE PRODUCT (the foregoing collectively referred to as\n    the Restricted Components), to any country, person or entity subject to U.S.\n    export restrictions. You specifically agree not to export or re-export any of\n    the Restricted Components (i) to any country to which the U.S. has embargoed\n    or restricted the export of goods or services, which currently include, but\n    are not necessarily limited to Cuba, Iran, Iraq, Libya, North Korea, Sudan\n    and Syria, or to any national of any such country, wherever located, who\n    intends to transmit or transport the Restricted Components back to such\n    country; (ii) to any person or entity who you know or have reason to know\n    will utilize the Restricted Components in the design, development or\n    production of nuclear, chemical or biological weapons; or (iii) to any person\n    or entity who has been prohibited from participating in U.S. export\n    transactions by any federal agency of the U.S. government. You warrant and\n    represent that neither the Bureau of Export Administration nor any other U.S.\n    federal agency has suspended, revoked or denied your export privileges.\n\n\nMISCELLANEOUS\n-------------\n\nThis EULA is governed by the laws of the Commonwealth of Massachusetts and the\nUnited States of America.\n\n\nLIMITED WARRANTY\n----------------\n\nACME warrants that (a) the SOFTWARE PRODUCT will perform substantially in\naccordance with the accompanying written materials for a period of ninety (90)\ndays from the date of receipt, and (b) any Support Services provided by ACME\nshall be substantially as described in applicable written materials provided to\nyou by ACME, and ACME support engineers will make commercially reasonable efforts\nto solve any problem issues. Some states and jurisdictions do not allow\nlimitations on duration of an implied warranty, so the above limitation may not\napply to you.\n\n\nCUSTOMER REMEDIES. ACMEs and its suppliersentire liability and your exclusive\nremedy shall be, at ACMEs option, either (a) return of the price paid, if any, or\n(b) repair or replacement of the SOFTWARE PRODUCT that does not meet ACMEs\nLimited Warranty and which is returned to ACME with a copy of your receipt. This\nLimited Warranty is void if failure of the SOFTWARE PRODUCT has resulted from\naccident, abuse, or misapplication. Any replacement SOFTWARE PRODUCT will be\nwarranted for the remainder of the original warranty period or thirty (30) days,\nwhichever is longer.\n\nNO OTHER WARRANTIES. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ACME AND\nITS SUPPLIERS DISCLAIM ALL OTHER WARRANTIES AND CONDITIONS, EITHER EXPRESS OR\nIMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, WITH REGARD TO THE\nSOFTWARE PRODUCT, AND THE PROVISION OF OR FAILURE TO PROVIDE SUPPORT SERVICES.\nTHIS LIMITED WARRANTY GIVES YOU SPECIFIC LEGAL RIGHTS. YOU MAY HAVE OTHERS, WHICH\nVARY FROM STATE/JURISDICTION TO STATE/JURISDICTION.\n \nLIMITATION OF LIABILITY. To the maximum extent permitted by applicable law, in no\nevent shall ACME or its suppliers be liable for any special, incidental,\nindirect, or consequential damages whatsoever (including, without limitation,\ndamages for loss of business profits, business interruption, loss of business\ninformation, or any other pecuniary loss) arising out of the use of or inability\nto use the SOFTWARE PRODUCT or the provision of or failure to provide Support\nServices, even if ACME has been advised of the possibility of such damages. In\nany case, ACMEs entire liability under any provision of this EULA shall be\nlimited to the greater of the amount actually paid by you for the SOFTWARE\nPRODUCT or U.S. $5.00; provided, however, if you have entered into a ACME Support\nServices Agreement, ACMEs entire liability regarding Support Services shall be\ngoverned by the terms of that agreement. Because some states and jurisdictions do\nnot allow the exclusion or limitation of liability, the above limitation may not\napply to you.","name":"Basic Proprietary Commercial License"},{"licenseId":"LicenseRef-7a1ed882-01c2-4f33-b92a-fe329122044d","extractedText":"LA_OPT_NXP_Software_License v60 February 2025\nIMPORTANT.  Read the following NXP Software License Agreement (\"Agreement\") completely. By selecting the \"I Accept\" button at the end of this page, or by downloading, installing, or using the Licensed Software, you indicate that you accept the terms of the Agreement, and you acknowledge that you have the authority, for yourself or on behalf of your company, to bind your company to these terms. You may then download or install the file. In the event of a conflict between the terms of this Agreement and any license terms and conditions for NXP’s proprietary software embedded anywhere in the Licensed Software file, the terms of this Agreement shall control.  If a separate license agreement for the Licensed Software has been signed by you and NXP, then that agreement shall govern your use of the Licensed Software and shall supersede this Agreement.\n\nNXP SOFTWARE LICENSE AGREEMENT\nThis is a legal agreement between your employer, of which you are an authorized representative, or, if you have no employer, you as an individual (\"you\" or \"Licensee\"), and and NXP USA, Inc., if Licensee is located within the United States or NXP Semiconductors Netherlands B.V., if Licensee if located outside of the United States (“NXP”).  It concerns your rights to use the software provided to you in binary or source code form and any accompanying written materials (the \"Licensed Software\"). The Licensed Software may include any updates or error corrections or documentation relating to the Licensed Software provided to you by NXP under this Agreement. In consideration for NXP allowing you to access the Licensed Software, you are agreeing to be bound by the terms of this Agreement. If you do not agree to all of the terms of this Agreement, do not download or install the Licensed Software. If you change your mind later, stop using the Licensed Software and delete all copies of the Licensed Software in your possession or control. Any copies of the Licensed Software that you have already distributed, where permitted, and do not destroy will continue to be governed by this Agreement. Your prior use will also continue to be governed by this Agreement.\n1.       DEFINITIONS\n1.1.         \"Affiliate\" means, with respect to a party, any corporation or other legal entity that now or hereafter Controls, is Controlled by or is under common Control with such party; where \"Control\" means the direct or indirect ownership of greater than fifty percent (50%) of the shares or similar interests entitled to vote for the election of directors or other persons performing similar functions. An entity is considered an Affiliate only so long as such Control exists.\n1.2\t\"Authorized System\" means either (i) Licensee’s hardware product which incorporates an NXP Product or (ii) Licensee’s software program which is used exclusively in connection with an NXP Product and with which the Licensed Software will be integrated.      \n1.3.\t\"Derivative Work\" means a work based upon one or more pre-existing works.  A work consisting of editorial revisions, annotations, elaborations, or other modifications which, as a whole, represent an original work of authorship, is a Derivative Work.         \n1.4\t\"Intellectual Property Rights\" means any and all rights under statute, common law or equity in and under copyrights, trade secrets, and patents (including utility models), and analogous rights throughout the world, including any applications for and the right to apply for, any of the foregoing.\n1.5\t\"NXP Product\" means a hardware product (e.g. a microprocessor, microcontroller, sensor or digital signal processor) and/or services (e.g. cloud platform services) supplied directly or indirectly from NXP or an NXP Affiliate, unless there is a product specified in the Software Content Register, in which case this definition is limited to such product.\n1.6      \"Software Content Register\" means the documentation which may accompany the Licensed Software which identifies the contents of the Licensed Software, including but not limited to identification of any Third Party Software, if any, and may also contain other related information as whether the license in 2.3 is applicable. \n1.7     \"Third Party Software\" means, any software included in the Licensed Software that is not NXP proprietary software, and is not open source software, and to which different license terms may apply. \n2.       LICENSE GRANT.  \n2.1.         If you are not expressly granted the distribution license in Section 2.3 in the Software Content Register, then you are only granted the rights in Section 2.2 and not in 2.3.  If you are expressly granted the distribution license in Section 2.3 in the Software Content Register, then you are granted the rights in both Section 2.2 and 2.3.\n2.2.\tStandard License.  Subject to the terms and conditions of this Agreement, NXP grants you a worldwide, personal, non-transferable, non-exclusive, non-sublicensable license, solely for the development of an Authorized System:\n(a)\tto use and reproduce the Licensed Software (and its Derivative Works prepared under the license in Section 2.2(b)) solely in combination with a NXP Product; and\n(b)\tfor Licensed Software provided to you in source code form (human readable), to prepare Derivative Works of the Licensed Software solely for use in combination with a NXP Product. \nYou may not distribute or sublicense the Licensed Software to others under the license granted in this Section 2.2. \nYou may demonstrate the Licensed Software to your direct customers as part of an Authorized System so long as such demonstration is directly controlled by you and without prior approval by NXP; however, to all other third parties only if NXP has provided its advance, written approval (e.g. email approval) of your demonstrating the Licensed Software to specified third parties or at specified event(s).  You may not leave the Licensed Software with a direct customer or any other third party at any time. \n2.3.        Additional Distribution License.  If expressly authorized in the Software Content Register, subject to the terms and conditions of this Agreement, NXP grants you a worldwide, personal, non-transferable, non-exclusive, non-sublicensable license solely in connection with your manufacturing and distribution of an Authorized System: \n(a)\tto manufacture (or have manufactured), distribute, and market the Licensed Software (and its Derivative Works prepared under the license in 2.2(b)) in object code (machine readable format) only as part of, or embedded within, Authorized Systems and not on a standalone basis solely for use in combination with a NXP Product.  Notwithstanding the foregoing, those files marked as .h files (\"Header files\") may be distributed in source or object code form, but only as part of, or embedded within Authorized Systems; and  \n(b)\tto copy and distribute as needed, solely in connection with an Authorized System and for use in combination with a NXP Product, non-confidential NXP information provided as part of the Licensed Software for the purpose of maintaining and supporting Authorized Systems with which the Licensed Software is integrated. \n2.4\tSeparate license grants to Third Party Software, or other terms applicable to the Licensed Software if different from those granted in this Section 2, are contained in Appendix A. The Licensed Software may be accompanied by a Software Content Register which will identify that portion of the Licensed Software, if any, that is subject to the different terms in Appendix A. \n2.5.         You may use subcontractors to exercise your rights under Section 2.2 and Section 2.3, if any, so long as you have an agreement in place with the subcontractor containing confidentiality restrictions no less stringent than those contained in this Agreement. You will remain liable for your subcontractors’ adherence to the terms of this Agreement and for any and all acts and omissions of such subcontractors with respect to this Agreement and the Licensed Software.\n3.       LICENSE LIMITATIONS AND RESTRICTIONS.  \n3.1.         The licenses granted above in Section 2 only extend to NXP Intellectual Property Rights that would be infringed by the unmodified Licensed Software prior to your preparation of any Derivative Work.   \n3.2.         The Licensed Software is licensed to you, not sold. Title to Licensed Software delivered hereunder remains vested in NXP or NXP’s licensor and cannot be assigned or transferred. You are expressly forbidden from selling or otherwise distributing the Licensed Software, or any portion thereof, except as expressly permitted herein. This Agreement does not grant to you any implied rights under any NXP or third party Intellectual Property Rights.\n3.3.         You may not translate, reverse engineer, decompile, or disassemble the Licensed Software except to the extent applicable law specifically prohibits such restriction. You must prohibit your subcontractors or customers (if distribution is permitted) from translating, reverse engineering, decompiling, or disassembling the Licensed Software except to the extent applicable law specifically prohibits such restriction.\n3.4.         You must reproduce any and all of NXP’s (or its third-party licensor’s) copyright notices and other proprietary legends on copies of Licensed Software.  \n3.5.         If you distribute the Licensed Software to the United States Government, then the Licensed Software is \"restricted computer software\" and is subject to FAR 52.227-19.   \n3.6.         You grant to NXP a non-exclusive, non-transferable, irrevocable, perpetual, worldwide, royalty-free, sub-licensable license under your Intellectual Property Rights to use without restriction and for any purpose any suggestion, comment or other feedback related to the Licensed Software (including, but not limited to, error corrections and bug fixes).\n3.7.         You will not take or fail to take any action that could subject the Licensed Software to an Excluded License. An Excluded License means any license that requires, as a condition of use, modification or distribution of software subject to the Excluded License, that such software or other software combined and/or distributed with the software be (i) disclosed or distributed in source code form; (ii) licensed for the purpose of making Derivative Works; or (iii) redistributable at no charge. \n3.8.         You may not publish or distribute reports associated with the use of the Licensed Software to anyone other than NXP.  You may advise NXP of any results obtained from your use of the Licensed Software, including any problems or suggested improvements thereof, and NXP retains the right to use such results and related information in any manner it deems appropriate.\n3.9.        Licensee may not use the Licensed Software as data or training input to any artificial intelligence models or machine learning algorithms.\n4.       OPEN SOURCE.         Open source software included in the Licensed Software is not licensed under the terms of this Agreement but is instead licensed under the terms of the applicable open source license(s), such as the BSD License, Apache License or the GNU Lesser General Public License. Your use of the open source software is subject to the terms of each applicable license. You must agree to the terms of each applicable license, or you cannot use the open source software.  \n5.       INTELLECTUAL PROPERTY RIGHTS.    \nUpon request, you must provide NXP the source code of any derivative of the Licensed Software.\nUnless prohibited by law, the following paragraph shall apply.  Your modifications to the Licensed Software, and all intellectual property rights associated with, and title thereto, will be the property of NXP.  You agree to assign all, and hereby do assign all rights, title, and interest to any such modifications to the Licensed Software to NXP and agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.  Further, you agree to waive all moral rights relating to your modifications to the Licensed Software, including, without limitation, all rights of identification of authorship and all rights of approval, restriction, or limitation on use or subsequent modification.  Notwithstanding the foregoing, you will have the license rights granted in Section 2 hereto to any such modifications made by you or your licensees.\nOtherwise, you agree to grant an irrevocable, worldwide, and perpetual license to NXP to make, have made, use, sell, offer to sell, import, commercialize, sublicense and reproduce your modifications or derivative works to the Licensed Software without any payment to Licensee. You agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.\n6.       ESSENTIAL PATENTS.    NXP has no obligation to identify or obtain any license to any Intellectual Property Right of a third-party that may be necessary for use in connection with technology that is incorporated into the Authorized System (whether or not as part of the Licensed Software).\n7.       TERM AND TERMINATION.   This Agreement will remain in effect unless terminated as provided in this Section.\n7.1.         You may terminate this Agreement immediately upon written notice to NXP at the address provided below.\n7.2.         Either party may terminate this Agreement if the other party is in default of any of the terms and conditions of this Agreement, and termination is effective if the defaulting party fails to correct such default within 30 days after written notice thereof by the non-defaulting party to the defaulting party at the address below.\n7.3.         Notwithstanding the foregoing, NXP may terminate this Agreement immediately upon written notice if you: breach any of your confidentiality obligations or the license restrictions under this Agreement;  become bankrupt, insolvent, or file a petition for bankruptcy or insolvency; make an assignment for the benefit of its creditors; enter proceedings for winding up or dissolution; are dissolved; or are nationalized or become subject to the expropriation of all or substantially all of your business or assets.\n7.4.         Upon termination of this Agreement, all licenses granted under Section 2 will expire. \n7.5.         After termination of this Agreement by either party   you will destroy all parts of Licensed Software and its Derivative Works (if any) and will provide to NXP a statement certifying the same.\n7.6.         Notwithstanding the termination of this Agreement for any reason, the terms of Sections 1 and 3 through 24 will survive.  \n8.        SUPPORT.  NXP is not obligated to provide any support, upgrades or new releases of the Licensed Software under this Agreement. If you wish, you may contact NXP and report problems and provide suggestions regarding the Licensed Software. NXP has no obligation to respond to such a problem report or suggestion. NXP may make changes to the Licensed Software at any time, without any obligation to notify or provide updated versions of the Licensed Software to you.\n9.        NO WARRANTY.  To the maximum extent permitted by law, NXP expressly disclaims any warranty for the Licensed Software. The Licensed Software is provided \"AS IS\", without warranty of any kind, either express or implied, including without limitation the implied warranties of merchantability, fitness for a particular purpose,  non-infringement, or any warranty that the Licensed Software is free from vulnerabilities. You assume the entire risk arising out of the use or performance of the licensed software, or any systems you design using the licensed software (if any).\n10.        INDEMNITY. You agree to fully defend and indemnify NXP from all claims, liabilities, and costs (including reasonable attorney’s fees) related to (1) your use (including your subcontractor’s or distributee’s use, if permitted) of the Licensed Software or (2) your violation of the terms and conditions of this Agreement.\n11.        LIMITATION OF LIABILITY.  EXCLUDING LIABILITY FOR A BREACH OF SECTION 2 (LICENSE GRANTS), SECTION 3 (LICENSE LIMITATIONS AND RESTRICTIONS), SECTION 16 (CONFIDENTIAL INFORMATION), OR CLAIMS UNDER SECTION 10 (INDEMNITY), IN NO EVENT WILL EITHER PARTY BE LIABLE, WHETHER IN CONTRACT, TORT, OR OTHERWISE, FOR ANY INCIDENTAL, SPECIAL, INDIRECT, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING, BUT NOT LIMITED TO, DAMAGES FOR ANY LOSS OF USE, LOSS OF TIME, INCONVENIENCE, COMMERCIAL LOSS, OR LOST PROFITS, SAVINGS, OR REVENUES, TO THE FULL EXTENT SUCH MAY BE DISCLAIMED BY LAW. NXP’S TOTAL LIABILITY FOR ALL COSTS, DAMAGES, CLAIMS, OR LOSSES WHATSOEVER ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT OR PRODUCT(S) SUPPLIED UNDER THIS AGREEMENT IS LIMITED TO THE AGGREGATE AMOUNT PAID BY YOU TO NXP IN CONNECTION WITH THE LICENSED SOFTWARE PROVIDED UNDER THIS AGREEMENT TO WHICH LOSSES OR DAMAGES ARE CLAIMED.\n\n12.        EXPORT COMPLIANCE. \n12.1\tEach party shall comply with all applicable export and import control laws and regulations including but not limited to the US Export Administration Regulation (including restrictions on certain military end uses and military end users as specified in Section 15 C.F.R. § 744.21 and prohibited party lists issued by other federal governments), Catch-all regulations and all national and international embargoes. Each party further agrees that it will not knowingly transfer, divert, export or re-export, directly or indirectly, any product, software, including software source code, or technology restricted by such regulations or by other applicable national regulations, received from the other party under this Agreement, or any direct product of such software or technical data to any person, firm, entity, country or destination to which such transfer, diversion, export or re-export is restricted or prohibited, without obtaining prior written authorization from the applicable competent government authorities to the extent required by those laws.\n12.2\tProhibition of Export to Russian Federation\n\n(a)\tWith respect to activity that falls under the scope of Article 12g, 12ga of Council Regulation (EU) No 833/2014, or Council Regulation (EU) No 765/2006 (as the case requires), you (a) will not sell, export or re-export, directly or indirectly any item, and (b) will not sell, license or sublicense any intellectual property rights or trade secrets, to the Russian Federation or Belarus, or for use in the Russian Federation or Belarus.\n\n(b)\tYou will ensure that the purpose of paragraph (a) above is not frustrated by any third parties further down the commercial chain, including by either resellers, sublicensees, or both.\n\n(c)\tYou will set up and maintain an adequate monitoring mechanism to detect conduct by any third parties further down the commercial chain, including by either resellers, sublicensees, or both, that would frustrate the purpose of paragraph (a).\n\n(d)\tAny violation of paragraphs (a), (b) or (c) will constitute a material breach of this Agreement, and NXP will be entitled to seek appropriate remedies, including, but not limited to: (i) termination of these Terms; (ii) suspension of any of its business relationships with you, youraffiliates or both, until the breach of paragraph (a) above is remedied, and (iii) a plan to remedy the breach.\n\n(e)\tYou will immediately inform NXP about any problems in applying paragraphs (a), (b) or (c), above, including any relevant activities by third parties that could frustrate the purpose of paragraph (a). You will make available to NXPinformation concerning compliance with the obligations under paragraphs (a), (b) and (c) within 2 weeks of the request for information.\n13.   GOVERNMENT CONTRACT COMPLIANCE\n13.1.      If you sell Authorized Systems directly to any government or public entity, including U.S., state, local, foreign or international governments or public entities, or indirectly via a prime contractor or subcontractor of such governments or entities, NXP makes no representations, certifications, or warranties whatsoever about compliance with government or public entity acquisition statutes or regulations, including, without limitation, statutes or regulations that may relate to pricing, quality, origin or content.\n13.2.      The Licensed Software has been developed at private expense and is a \"Commercial Item\" as defined in 48 C.F.R. Section 2.101, consisting of \"Commercial Computer Software\", and/or \"Commercial Computer Software Documentation,\" as such terms are used in 48 C.F.R. Section 12.212 (or 48 C.F.R. Section 227.7202, as applicable) and may only be licensed to or shared with U.S. Government end users in object code form as part of, or embedded within, Authorized Systems. Any agreement pursuant to which you share the Licensed Software will include a provision that reiterates the limitations of this document and requires all sub-agreements to similarly contain such limitations. \n14.        CRITICAL APPLICATIONS.  In some cases, NXP may promote certain software for use in the development of, or for incorporation into, products or services (a) used in applications requiring fail-safe performance or (b) in which failure could lead to death, personal injury, or severe physical or environmental damage (these products and services are referred to as \"Critical Applications\"). NXP’s goal is to educate customers so that they can design their own end-product solutions to meet applicable functional safety standards and requirements. Licensee makes the ultimate design decisions regarding its products and is solely responsible for compliance with all legal, regulatory, safety, and security related requirements concerning its products, regardless of any information or support that may be provided by NXP. As such, Licensee assumes all risk related to use of the Licensed Software in Critical Applications and NXP SHALL NOT BE LIABLE FOR ANY SUCH USE IN CRITICAL APPLICATIONS BY LICENSEE. Accordingly, Licensee will indemnify and hold NXP harmless from any claims, liabilities, damages and associated costs and expenses (including attorneys’ fees) that NXP may incur related to Licensee’s incorporation of the Licensed Software in a Critical Application.\n15.        CHOICE OF LAW; VENUE.  When Software is licensed by NXP USA, Inc., Licensee agrees that the laws of the State of Texas, USA, without regard to conflicts of laws principles, will apply to all matters relating to this Agreement or the Software, and Licensee agrees that any litigation will be subject to the exclusive jurisdiction of the state or federal courts in Austin, Texas, USA..  When Software is licensed by NXP Semiconductors Netherlands B.V., Licensee agrees that the laws of The Netherlands, without regard to conflicts of laws principles, will apply to all matters relating to this Agreement or the Software, and Licensee agrees that any litigation will be subject to the exclusive jurisdiction of the courts in Amsterdam, The Netherlands. Notwithstanding the foregoing, NXP will always be permitted to bring any action or proceedings against Licensee in any other court of competent jurisdiction. The United Nations Convention on Contracts for the International Sale of Goods will not apply to this document. \n16.        CONFIDENTIAL INFORMATION.  Subject to the license grants and restrictions contained herein, you must treat the Licensed Software as confidential information and you agree to retain the Licensed Software in confidence perpetually. You may not disclose any part of the Licensed Software to anyone other than distributees in accordance with Section 2.3 and employees, or subcontractors in accordance with Section 2.5, who have a need to know of the Licensed Software and who have executed written agreements obligating them to protect such Licensed Software to at least the same degree of confidentiality as in this Agreement. You agree to use the same degree of care, but no less than a reasonable degree of care, with the Licensed Software as you do with your own confidential information. You may disclose Licensed Software to the extent required by a court or under operation of law or order provided that you notify NXP of such requirement prior to disclosure, which you only disclose the minimum of the required information, and that you allow NXP the opportunity to object to such court or other legal body requiring such disclosure. \n17.       TRADEMARKS.  You are not authorized to use any NXP trademarks, brand names, or logos.\n18.        ENTIRE AGREEMENT.  This Agreement constitutes the entire agreement between you and NXP regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in written form, signed by you and NXP.\n19.        SEVERABILITY.  If any provision of this Agreement is held for any reason to be invalid or unenforceable, then the remaining provisions of this Agreement will be unimpaired and, unless a modification or replacement of the invalid or unenforceable provision is further held to deprive you or NXP of a material benefit, in which case the Agreement will immediately terminate, the invalid or unenforceable provision will be replaced with a provision that is valid and enforceable and that comes closest to the intention underlying the invalid or unenforceable provision.\n20.        NO WAIVER.  The waiver by NXP of any breach of any provision of this Agreement will not operate or be construed as a waiver of any other or a subsequent breach of the same or a different provision.\n21.        AUDIT.  You will keep full, clear and accurate records with respect to your compliance with the limited license rights granted under this Agreement for three years following expiration or termination of this Agreement. NXP will have the right, either itself or through an independent certified public accountant to examine and audit, at NXP’s expense, not more than once a year, and during normal business hours, all such records that may bear upon your compliance with the limited license rights granted above. You must make prompt adjustment to compensate for any errors and/or omissions disclosed by such examination or audit.\n22.        NOTICES.             All notices and communications under this Agreement will be made in writing, and will be effective when received at the following addresses: \nNXP:\t\nNXP B.V.\nHigh Tech Campus 60\n5656 AG Eindhoven\nThe Netherlands\nATTN: Legal Department\n \t         \nYou:\t\nThe address provided at registration will be used.\n\n23.        RELATIONSHIP OF THE PARTIES.     The parties are independent contractors. Nothing in this Agreement will be construed to create any partnership, joint venture, or similar relationship. Neither party is authorized to bind the other to any obligations with third parties.\n24.        SUCCESSION AND ASSIGNMENT.   This Agreement will be binding upon and inure to the benefit of the parties and their permitted successors and assigns.  You may not assign this Agreement, or any part of this Agreement, without the prior written approval of NXP, which approval will not be unreasonably withheld or delayed. NXP may assign this Agreement, or any part of this Agreement, in its sole discretion. \n25.\tPRIVACY. By agreeing to this Agreement and/or utilizing the Licensed Software, Licensee consents to use of certain personal information, including but not limited to name, email address, and location, for the purpose of NXP’s internal analysis regarding future software offerings.  NXP’s complete Privacy Statement can be found at: https://www.nxp.com/company/our-company/about-nxp/privacy-statement:PRIVACYPRACTICES.\n \nAPPENDIX A\nOther License Grants and Restrictions:\n\nThe Licensed Software may include some or all of the following software, which is either 1) Third Party Software or 2) NXP proprietary software subject to different terms than those in the Agreement. If the Software Content Register that accompanies the Licensed Software identifies any of the following Third Party Software or specific components of the NXP proprietary software, the following terms apply to the extent they deviate from the terms in the Agreement:\n\nAGGIOS, Inc.: EnergyLab LITE and Seed software are distributed by NXP under license from AGGIOS, Inc. Your use of AGGIOS software, as the Licensee, is subject to the following: (i) use of AGGIOS software is limited to object code and Authorized System only; (ii) Licensee may not sublicense the AGGIOS software to any third party; (iii) Licensee is only granted an evaluation license for the Seed software, defined as license to use the Seed software internally for own evaluation purposes, limited to three (3) months. Further rights including but not limited to production deployment must be obtained directly from AGGIOS, Inc. \n\nAirbiquity Inc.: The Airbiquity software may only be used in object code and Licensee may not sublicense the Airbiquity software to any third party. Licensee’s license to use the Airbiquity software expires on June 30, 2026.\n\nAmazon: Use of the Amazon software constitutes your acceptance of the terms of the Amazon Program Materials License Agreement (including the AVS Component Schedule, if applicable), located at https://developer.amazon.com/support/legal/pml.  All Amazon software is hereby designated \"Amazon confidential\".  With the exception of the binary library of the Amazon Wake Word Engine for \"Alexa\", all Amazon software is also hereby designated as \"Restricted Program Materials\". Amazon is a third-party beneficiary to this Agreement with respect to the Amazon software.\n\nAmazon Web Services, Inc.: AWS is an intended third-party beneficiary to this Agreement with respect to the Greengrass software. If you have an account with AWS that is not in good standing, you may not download, install, use or distribute the Greengrass software. You will comply with all instructions and requirements in any integration documents, guidelines, or other documentation AWS provides. The license to the Greengrass software will immediately terminate without notice if you (a) fail to comply with this Agreement or any other agreement with AWS, (b) fail to make timely payment for any AWS service, (c) fail to implement AWS updates, or (d) bring any action for intellectual property infringement against AWS or any AWS customer utilizing AWS services.  Any dispute or claim relating to your use of the Greengrass software will be resolved by binding arbitration, rather than in court, except that you may assert claims in small claims court if your claims qualify.\n\nAmazon: AWS Fleetwise software must be used consistent with the terms found here: https://github.com/aws/aws-iot-fleetwise-edge/blob/main/LICENSE.\n\nAmphion Semiconductor Ltd.: Distribution of Amphion software must be a part of, or embedded within, Authorized Systems that include an Amphion Video Decoder.  \n\nApple MFi Software Development Kit: Use of Apple MFi Software and associated documentation is restricted to current Apple MFi licensees in accordance with the terms of their own valid and in-effect license from Apple.\n\nAquantia Corp.: You may use Aquantia's API binaries solely to flash the API software to an NXP Product which mates with an Aquantia device.\n\nArgus Cyber Security: The Argus software may only be used in object code and only for evaluation and demonstration purposes.\n\nArm Toolkit: This tool is owned by Arm Limited. You may not reverse engineer, decompile or dissemble any ARM Toolkit. You agree to abide by any third-party IP requirements, including the relevant license terms where applicable, where such third-party IP is identified in the documentation provided with the ARM Toolkit. You may not copy the Arm Toolkit except solely for archival and backup purposes provided all notices are preserved. Arm disclaims any and all liability related to your use of the ARM Toolkit.\n\nAtheros: Use of Atheros software is limited to evaluation and demonstration only.  Permitted distributions must be similarly limited. Further rights must be obtained directly from Atheros.    \n\nATI (AMD): Distribution of ATI software must be a part of, or embedded within, Authorized Systems that include a ATI graphics processor core.  \n\nAu-Zone Technologies: eIQ Portal, Model Tool, DeepViewRT and ModelRunner are distributed by NXP under license from Au-Zone Technologies.  Your use of the Licensed Software, examples and related documentation is subject to the following:\n(1)          Use of Software is limited to Authorized System only\n(2)          In no event may Licensee Sublicense the Software\n(3)          AU-ZONE TECHNOLOGIES SHALL NOT BE LIABLE FOR USE OF LICENSED SOFTWARE IN CRITICAL APPLICATIONS BY LICENSEE\n\nBroadcom Corporation: Your use of Broadcom Corporation software is restricted to Authorized Systems that incorporate a compatible integrated circuit device manufactured or sold by Broadcom.\n\nCadence Design Systems: Use of Cadence audio codec software is limited to distribution only of one copy per single NXP Product. The license granted herein to the Cadence Design Systems HiFi aacPlus Audio Decoder software does not include a license to the AAC family of technologies which you or your customer may need to obtain. Configuration tool outputs may only be distributed by licensees of the relevant Cadence SDK and distribution is limited to distribution of one copy embedded in a single NXP Product. Your use of Cadence NatureDSP Libraries whether in source code or in binary is restricted to NXP SoC based systems or emulation enablement based on NXP SoC.\n\nCEVA D.S.P. Ltd. And CEVA Technologies Inc. (\"CEVA\"): The CEVA-SPF2 linear algebra, CEVA-SPF2 Neural Network Libraries, CEVA-SPF2 Core Libraries, CEVA-SPF2 OpenAMP and CEVA-SPF2 STL licensed modules are owned by CEVA and such materials may only be used in connection with an NXP product containing the S250 or S125 integrated circuits, whether or not the CEVA-SPF2 Core is physically implemented and/or enabled on such NXP product\n\nCirque Corporation: Use of Cirque Corporation technology is limited to evaluation, demonstration, or certification testing only. Permitted distributions must be similarly limited. Further rights, including but not limited to ANY commercial distribution rights, must be obtained directly from Cirque Corporation. \n\nCoding Technologies (Dolby Labs): Use of CTS software is limited to evaluation and demonstration only.  Permitted distributions must be similarly limited. Further rights must be obtained from Dolby Laboratories. \n\nCoremark:  Use of the Coremark benchmarking software is subject to the following terms and conditions:  https://github.com/eembc/coremark/blob/main/LICENSE.md\n\nCSR: Use of Cambridge Silicon Radio, Inc. (\"CSR\") software is limited to evaluation and demonstration only.  Permitted distributions must be similarly limited.  Further rights must be obtained directly from CSR. \n\nCrank: Use of Crank Software Inc. software is limited to evaluation and demonstration only. Permitted distributions must be similarly limited. Further rights must be obtained directly from Crank Software Inc.\n\nCypress Semiconductor Corporation: WWD RTOS source code may only be used in accordance with the Cypress IOT Community License Agreement obtained directly from Cypress Semiconductor Corporation. \n\nElektrobit Automotive GmbH (\"EB\"): EB software must be used consistent with the EB License Terms and Conditions, Version 1.4 (Dec 2019) found here: https://www.elektrobit.com/legal-notice/ .  Licensee is only granted an evaluation license for the EB software, defined as license to use the EB software internally for own evaluation purposes, limited to three (3) months. Production deployment of the EB software using this license is prohibited. See additionally Section 2.1.1 EB EULA.\n\nEmbedded Systems Academy GmbH (EmSA):  Any use of Micro CANopen Plus is subject to the acceptance of the license conditions described in the LICENSE.INFO file distributed with all example projects and in the documentation and the additional clause described below.\nClause 1: Micro CANopen Plus may not be used for any competitive or comparative purpose, including the publication of any form of run time or compile time metric, without the express permission of EmSA.\n\nFenopix Technologies Private Limited: Under no circumstances may the CanvasJS software product be used in any way that would compete with any product from Fenopix.  License to the CanvasJS software will terminate immediately without notice if Licensee fail to comply with any provision of this Agreement.\n\nFraunhofer IIS: Fraunhofer MPEG Audio Decoder (Fraunhofer copyright) - If you are provided MPEG-H decoding functionality, you understand that NXP will provide Fraunhofer your name and contact information.\n\nFuture Technology Devices International Ltd.: Future Technology Devices International software must be used consistent with the terms found here: http://www.ftdichip.com/Drivers/FTDriverLicenceTerms.htm \n\nGlobal Locate (Broadcom Corporation): Use of Global Locate, Inc. software is limited to evaluation and demonstration only.  Permitted distributions must be similarly limited.  Further rights must be obtained from Global Locate.    \n\nIAR Systems: Use of IAR flashloader or any IAR source code is subject to the terms of the IAR Source License located within the IAR zip package. The IAR Source License applies to linker command files, example projects unless another license is explicitly stated, the cstartup code, low_level_init.c, and some other low-level runtime library files.\n\nLC3plus: the LC3plus Low Complexity Communication Codec Plus (LC3plus) per ETSI TS 103 634 V1.3.1, is subject to ETSI Intellectual Property Rights Policy, See https://portal.etsi.org/directives/45_directives_jun_2022.pdf. For application in an End Product, Fraunhofer communication applies, see https://www.iis.fraunhofer.de/en/ff/amm/communication/lc3.html\n\nLumissil: Use of the Lumissil software constitutes your acceptance of the terms of the Lumissil Software License Agreement.  A link to the agreement is incorporated as follows: https://www.lumissil.com/assets/pdf/support/2023%20Lumissil%20IS3xCG5317%20Software%20License%20Agreement%20NXP.pdf .  The Run-Time Software and Boot ROM Code are without warranty of any kind from NXP or Lumissil, either express or implied, including without limitation the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. You assume the entire risk arising out of the use or performance of the Lumissil software, or any systems you design using the such, if any.  For the use of Lumissil software, Lumissil is as a third-party beneficiary of the this Agreement with authority to enforce its rights in the Run-Time Software and Boot ROM Code.\n\nMicrosoft: Except for Microsoft PlayReady software, if the Licensed Software includes software owned by Microsoft Corporation (\"Microsoft\"), it is subject to the terms of your license with Microsoft (the \"Microsoft Underlying Licensed Software\") and as such, NXP grants no license to you, beyond evaluation and demonstration in connection with NXP processors, in the Microsoft Underlying Licensed Software.  You must separately obtain rights beyond evaluation and demonstration in connection with the Microsoft Underlying Licensed Software from Microsoft. Microsoft does not provide support services for the components provided to you through this Agreement.  If you have any questions or require technical assistance, please contact NXP.  Microsoft Corporation is a third party beneficiary to this Agreement with the right to enforce the terms of this Agreement.  TO THE MAXIMUM EXTENT PERMITTED BY LAW, MICROSOFT AND ITS AFFILIATES DISCLAIM ANY WARRANTIES FOR THE MICROSOFT UNDERLYING LICENSED SOFTWARE.  TO THE MAXIMUM EXTENT PERMITTED BY LAW, NEITHER MICROSOFT NOR ITS AFFILIATES WILL BE LIABLE, WHETHER IN CONTRACT, TORT, OR OTHERWISE, FOR ANY DIRECT, INCIDENTAL, SPECIAL, INDIRECT, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING, BUT NOT LIMITED TO, DAMAGES FOR ANY LOSS OF USE, LOSS OF TIME, INCONVENIENCE, COMMERCIAL LOSS, OR LOST PROFITS, SAVINGS, OR REVENUES, ARISING FROM THE FROM THE USE OF THE MICROSOFT UNDERLYING LICENSED SOFTWARE.  With respect to the Microsoft PlayReady software, you will have the license rights granted in Section 2, provided that you may not use the Microsoft PlayReady software unless you have entered into a Microsoft PlayReady Master Agreement and license directly with Microsoft. \n\nMindTree: Notwithstanding the terms contained in Section 2.3 (a), if the Licensed Software includes proprietary software of MindTree in source code format, Licensee may make modifications and create derivative works only to the extent necessary for debugging of the Licensed Software. \n\nMM SOLUTIONS EAD:  Use of the following MM SOLUTIONS software is limited to use in conjuncture with NXP Products that have the Imaging Subsystem Processor (ISP) enabled (fusing configuration), as indicated in the applicable data sheet: (i) MMS Tuning Tool; (ii) Camera Development Kit (uGuzzi); (iii) and additional Camera Software. For the purposes of this Agreement, “Camera Software” means: (a) AEC (Auto Exposure Control); (b) AWB (Auto White Balance), (c) Auto Focus; (d) Wide Dynamic Range; (e) LED Flicker Mitigation; and (f) Multi-Camera Harmonization.  In no event may Licensee distribute or sublicense the MM SOLUTIONS software, unless otherwise licensed to do so by issuance of the distribution rights under Section 2.3 of the Agreement. Any further rights must be obtained directly from MM SOLUTIONS directly.\n\nMPEG LA: Use of MPEG LA audio or video codec technology is limited to evaluation and demonstration only. Permitted distributions must be similarly limited. Further rights must be obtained directly from MPEG LA.  \n\nMQX RTOS Code: MQX RTOS source code may not be re-distributed by any NXP Licensee under any circumstance, even by a signed written amendment to this Agreement. \n\nNXP Voice Software: VoiceSpot, VoiceSeeker (including AEC), VIT Speech to Intent, and Conversa are subject to the terms of Section 2.2 only. Any commercial distribution rights are subject to a separate royalty agreement obtained from NXP.\n\nTogether with the voice communication algorithm Conversa Licensee may get a tuning tool from DevExpress and/or Lightning Chart in form of certain libraries noted as ([name].dll) (“Tool”). Conversa as well as the Tool may only be used by Licensee internally during testing, evaluation or product development solely for tuning purposes of Licensee’s products in connection with Conversa. Any use of Conversa or the Tool outside the scope of this license is strictly prohibited, distributing the Libraries in any form. Licensee may use Conversa in connection with its products only following the execution of a separate royalty agreement with NXP.  \nNXP Wireless Charging Library: License to the Software is limited to use in inductive coupling or wireless charging applications \n\nON Semiconductor: ON Semiconductor AP1302 Image Signal Processor Initialization Binaries must be used consistent with the terms found here: https://github.com/ONSemiconductor/ap1302_binaries/blob/main/AP1302%20Software%20License%20Agreement.pdf\n\nOpus: Use of Opus software must be consistent with the terms of the Opus license which can be found at: http://www.opus-codec.org/license/  \n\nOracle JRE (Java): The Oracle JRE must be used consistent with terms found here: http://java.com/license \n\nP&E Micro: P&E Software must be used consistent with the terms found here: http://www.pemicro.com/licenses/gdbserver/license_gdb.pdf \n\nPro Design Electronic: Licensee may not modify, create derivative works based on, or copy the Pro Design software, documentation, hardware execution key or the accompanying materials.  Licensee shall not use Pro Design's or any of its licensors names, logos or trademarks to market the Authorized System.  Only NXP customers and distributors are permitted to further redistribute the Pro Design software and only as part of an Authorized System which contains the Pro Design software.\n\nQualcomm Atheros, Inc.: Notwithstanding anything in this Agreement, Qualcomm Atheros, Inc. Wi-Fi software must be used strictly in accordance with the Qualcomm Atheros, Inc. Technology License Agreement that accompanies such software.  Any other use is expressly prohibited.\n\nReal Networks - GStreamer Optimized Real Format Client Code implementation or OpenMax Optimized Real Format Client Code: Use of the GStreamer Optimized Real Format Client Code, or OpenMax Optimized Real Format Client code is restricted to applications in the automotive market.  Licensee must be a final manufacturer in good standing with a current license with Real Networks for the commercial use and distribution of products containing the GStreamer Optimized Real Format Client Code implementation or OpenMax Optimized Real Format Client Code\n\nReal-Time Innovations, Inc.: Not withstanding anything in this Agreement, Real-Time Innovations, Inc. software must be used strictly in accordance with Real-Time Innovations, Inc.'s Automotive Software Evaluation License Agreement, available here: https://www.rti.com/hubfs/_Collateral/Services_and_Support/Automotive_Evaluation_SLA_90_dayNXP.pdf .  Any other use is expressly prohibited.\n\nRivieraWaves SAS (a member of the CEVA, Inc. family of companies): You may not use the RivieraWaves intellectual property licensed under this Agreement if you develop, market, and/or license products similar to such RivieraWaves intellectual property.  Such use constitutes a breach of this Agreement.  Any such use rights must be obtained directly from RivieraWaves.\n\nSanDisk Corporation: If the Licensed Software includes software developed by SanDisk Corporation (\"SanDisk\"), you must separately obtain the rights to reproduce and distribute this software in source code form from SanDisk.  Please follow these easy steps to obtain the license and software:  \n(1) Contact your local SanDisk sales representative to obtain the SanDisk License Agreement.  \n(2) Sign the license agreement.  Fax the signed agreement to SanDisk USA marketing department at 408-542-0403.  The license will be valid when fully executed by SanDisk. \n(3) If you have specific questions, please send an email to sales@sandisk.com \nYou may only use the SanDisk Corporation Licensed Software on products compatible with a SanDisk Secure Digital Card.  You may not use the SanDisk Corporation Licensed Software on any memory device product.  SanDisk retains all rights to any modifications or derivative works to the SanDisk Corporation Licensed Software that you may create. \n\nSEGGER Microcontroller - emWin Software: Your use of SEGGER emWin software and components is restricted for development of NXP ARM7, ARM9, Cortex-M0, Cortex-M3, Cortex-M4, Cortex-M33, Cortex-M7, and Cortex-A7 based products only.\n\nSEGGER Microcontroller - J-Link/J-Trace Software: Segger software must be used consistent with the terms found here: http://www.segger.com/jlink-software.html \n\nSEVENSTAX - Not withstanding anything in this Agreement, SEVENSTAX GmbH software must be used for evaluation purposes only, in strict accordance with the SEVENSTAX License Agreement, available here: https://www.sevenstax.de/fileadmin/documents/SEVENSTAX-NX-ESLA.txt. Any other use, and embedding the software into commercial products, is expressly prohibited.\nSynopsys/BLE Software: Your use of the Synopsys/BLE Software and related documentation is subject to the following:\n(1) Synopsys is third-party beneficiaries of, and thus may enforce against you, the license restrictions and confidentiality obligations in this agreement with respect to their intellectual property and proprietary information.\n(2) Your distribution of the Licensed Software shall subject any recipient to a written agreement at least as protective of the Licensed Software as provided in this Agreement. \n\nSynopsys/Target Compiler Technologies: Your use of the Synopsys/Target Compiler Technologies Licensed Software and related documentation is subject to the following: \n(1) Duration of the license for the Licensed Software is limited to 12 months, unless otherwise specified in the license file. \n(2) The Licensed Software is usable by one user at a time on a single designated computer, unless otherwise agreed by Synopsys.  \n(3) Licensed Software and documentation are to be used only on a designated computer at the designated physical address provided by you on the APEX license form. \n(4) The Licensed Software is not sub-licensable. \n\nT2 Labs / T2 Software:  As a condition to the grant of any license under this Agreement, you represent and warrant that you will comply with all licenses, agreements, rules and bylaws of the Bluetooth SIG (Special Interest Group ) applicable to the licensed software and documentation and its use which may affect when and if you may take certain actions under licenses granted hereunder.\n \nThe license grant under this Agreement is conditional to you being (i) a Bluetooth SIG Associate member until such time as the specifications for the software are made public to Bluetooth SIG members of any level and (ii) thereafter a Bluetooth SIG member of any level.\n \nNotwithstanding the terms contained in Section 2.3 (a), if the licensed software includes proprietary software in source code format, you may make modifications and create derivative works only to the extent necessary for improving the performance of the source code with the NXP products or your products and for creating enhancements of such products. You may not further sublicense or otherwise distribute the source code, or any modifications or derivatives thereof as stand-alone products.  You will be responsible for qualifying any modifications or derivatives with the Bluetooth SIG and any other qualifying bodies.\n\nTARA Systems: Use of TARA Systems GUI technology Embedded Wizard is limited to evaluation and demonstration only. Permitted distributions must be similarly limited. Further rights must be obtained directly from TARA Systems.\n\nTeensyduino Core Library:  If the Teensyduino Core Library or documentation is incorporated into a build system that allows selection among a list of target devices, then similar target devices manufactured by PJRC.com must be included in the list of target devices and selectable in the same manner.\n\nTexas Instruments: Your use of Texas Instruments Inc. WiLink8 Licensed Software is restricted to NXP SoC based systems that include a compatible connectivity device manufactured by TI.  \n\nTES Electronic Solutions Germany (TES):  TES 3D Surround View software and associated data and documentation may only be used for evaluation purposes and for demonstration to third parties in integrated form on a board package containing an NXP S32V234 device. Licensee may not distribute or sublicense the TES software. Your license to the TES software may be terminated at any time upon notice.\n\nVivante: Distribution of Vivante software must be a part of, or embedded within, Authorized Systems that include a Vivante Graphics Processing Unit.  \n\nWittenstein:  Your use of the SafeRTOS v9.x and Networking Stack, in object form, is limited to your internal testing, evaluation, feedback and development specifically for use with an NXP Product.  Licensee’s license to use and supply the software to you expires on June 25, 2026.  Further rights must be obtained directly from Wittenstein.\n","name":"LA_OPT_NXP_Software_License v60 February 2025 clause 2.3"},{"licenseId":"LicenseRef-babf777f-042b-42df-a5bf-638993427038","extractedText":"LA_OPT_Online Code Hosting NXP_Software_License - v1.4 May 2025 \nIMPORTANT.  Read the following NXP Online Code Hosting Software License Agreement (“Agreement”) completely. By selecting the “I Accept” button at the end of this page, or by downloading, installing, or using the Licensed Software, including via GitHub or similar platform, you indicate that you accept the terms of the Agreement, and you acknowledge that you have the authority, for yourself or on behalf of your company, to bind your company to these terms. You may then download or install the software or obtain it via GitHub or similar platform. In the event of a conflict between the terms of this Agreement and any license terms and conditions for NXP’s proprietary software embedded anywhere in the Licensed Software file, the terms of this Agreement shall control.  If a separate license agreement for the Licensed Software has been signed by you and NXP, then that agreement shall govern your use of the Licensed Software and shall supersede this Agreement. \n\nNXP ONLINE CODE HOSTING SOFTWARE LICENSE AGREEMENT\nThis is a legal agreement between your employer, of which you are an authorized representative, or, if you have no employer, you as an individual (“you” or “Licensee”), and NXP B.V. (“NXP”).  It concerns your rights to use the software provided to you in binary or source code form and any accompanying written materials (the “Licensed Software”). The Licensed Software may include any updates or error corrections or documentation relating to the Licensed Software provided to you by NXP under this Agreement. In consideration for NXP allowing you to access the Licensed Software, you are agreeing to be bound by the terms of this Agreement. If you do not agree to all of the terms of this Agreement, do not download, install or copy from GitHub or similar platform, the Licensed Software. If you change your mind later, stop using the Licensed Software and delete all copies of the Licensed Software in your possession or control. Any copies of the Licensed Software that you have already distributed, where permitted, and do not destroy will continue to be governed by this Agreement. Your prior use will also continue to be governed by this Agreement.\n1.\tDEFINITIONS\n\n1.1.\t“Affiliate” means, with respect to a party, any corporation or other legal entity that now or hereafter Controls, is Controlled by or is under common Control with such party; where “Control” means the direct or indirect ownership of greater than fifty percent (50%) of the shares or similar interests entitled to vote for the election of directors or other persons performing similar functions. An entity is considered an Affiliate only so long as such Control exists.\n\n1.2.\t“Authorized System” means either (i) Licensee’s hardware product which incorporates an NXP Product or (ii) Licensee’s software program which is used exclusively in connection with an NXP Product and with which the Licensed Software will be integrated.      \n\n1.3.\t“Derivative Work” means a work based upon one or more pre-existing works.  A work consisting of editorial revisions, annotations, elaborations, or other modifications which, as a whole, represent an original work of authorship, is a Derivative Work.\n\n1.4.\t“Intellectual Property Rights” means any and all rights under statute, common law or equity in and under copyrights, trade secrets, and patents (including utility models), and analogous rights throughout the world, including any applications for and the right to apply for, any of the foregoing.\n\n1.5.\t“NXP Product” means a hardware product (e.g., a microprocessor, microcontroller, sensor or digital signal processor) and/or services (e.g., cloud platform services) supplied directly or indirectly from NXP or an NXP Affiliate, unless there is a product specified in the Software Content Register, in which case this definition is limited to such product.\n\n1.6.\t“Software Content Register” means the documentation which may accompany the Licensed Software which identifies the contents of the Licensed Software. \n\n2.\tLICENSE GRANT.  \n\n2.1.\tStandard License.  Subject to the terms and conditions of this Agreement, NXP grants you a worldwide, personal, non-transferable, non-exclusive, non-sublicensable license, solely for the development of an Authorized System:\n\n(a)\tto use and reproduce the Licensed Software (and its Derivative Works prepared under the license in Section 2.1(b)) solely for use in combination with a NXP Product;\n\n(b)\tto prepare Derivative Works of the Licensed Software solely for use in combination with a NXP Product;\n\n(c)\tto manufacture (or have manufactured), distribute, and market object code of the Licensed Software (and its Derivative Works prepared under the license in 2.1(b)) only as part of, or embedded within, Authorized Systems and not on a standalone basis;\n\n(d)\tto copy and distribute as needed, solely in connection with an Authorized System, NXP information provided as part of the Licensed Software for the purpose of maintaining and supporting Authorized Systems which use the Licensed Software; and\n\n(e)\tto distribute the Licensed Software (and its Derivative Works prepared under the license in 2.1(b)) in a source code form on a standalone basis using any means of distribution including GitHub or similar platform, for use with Authorized Systems, provided that you provide every recipient of the License Software a copy of this Agreement, conspicuously  indicate that the Licensed Software is provided under this Agreement, and assure that the recipient understands that by receiving or using the Licensed Software it has entered into this Agreement with NXP.  You are responsible for any violation of this Agreement by anyone who received source code of the Licensed Software from you.\n\n2.2.\tYou may use subcontractors to exercise your rights under Section 2.1, if any, so long as you have an agreement in place with the subcontractor containing restrictions no less stringent than those contained in this Agreement. You will remain liable for your subcontractors’ adherence to the terms of this Agreement and for any and all acts and omissions of such subcontractors with respect to this Agreement and the Licensed Software.\n \n3.\tLICENSE LIMITATIONS AND RESTRICTIONS.  \n\n3.1.\tThe licenses granted above in Section 2 only extend to NXP Intellectual Property Rights that would be infringed by the unmodified Licensed Software prior to your preparation of any Derivative Work.\n\n3.2.\tThe Licensed Software is licensed to you, not sold. Title to Licensed Software delivered hereunder remains vested in NXP or NXP’s licensor and cannot be assigned or transferred. You are expressly forbidden from selling or otherwise distributing the Licensed Software, or any portion thereof, except as expressly permitted herein. This Agreement does not grant to you any implied rights under any NXP or third-party Intellectual Property Rights.\n\n3.3.\tYou may not translate, reverse engineer, decompile, or disassemble the Licensed Software except to the extent applicable law specifically prohibits such restriction. You must prohibit your subcontractors or customers from translating, reverse engineering, decompiling, or disassembling the Licensed Software except to the extent applicable law specifically prohibits such restriction.\n\n3.4.\tYou must reproduce any and all of NXP’s (or its third-party licensor’s) copyright notices and other proprietary legends on copies of Licensed Software.  \n\n3.5.\tIf you distribute the Licensed Software to the United States Government, then the Licensed Software is “restricted computer software” and is subject to FAR 52.227-19.   \n\n3.6.\tYou grant to NXP a non-exclusive, non-transferable, irrevocable, perpetual, worldwide, royalty-free, sub-licensable license under your Intellectual Property Rights to use without restriction and for any purpose any suggestion, comment or other feedback related to the Licensed Software (including, but not limited to, error corrections and bug fixes).\n\n3.7.\tYou will not take or fail to take any action that could subject the Licensed Software to an Excluded License. An Excluded License means any license that requires, as a condition of use, modification or distribution of software subject to the Excluded License, that such software or other software combined and/or distributed with the software be (i) disclosed or distributed in source code form; (ii) licensed for the purpose of making Derivative Works; or (iii) redistributable at no charge. \n\n3.8.\tYou may not publish or distribute reports associated with the use of the Licensed Software to anyone other than NXP.  You may advise NXP of any results obtained from your use of the Licensed Software, including any problems or suggested improvements thereof, and NXP retains the right to use such results and related information in any manner it deems appropriate.\n\n4.\tOPEN SOURCE.  Open-source software included in the Licensed Software is not licensed under the terms of this Agreement but is instead licensed under the terms of the applicable open-source license(s), such as the BSD License, Apache License or the GNU Lesser General Public License. Your use of the open-source software is subject to the terms of each applicable license. You must agree to the terms of each applicable license, or you cannot use the open-source software.  \n \n5.\tINTELLECTUAL PROPERTY RIGHTS.\n\n5.1.\tUpon request, you must provide NXP the source code of any derivative of the Licensed Software.\n\n5.2.\tUnless prohibited by law, the following paragraph shall apply.  Your modifications to the Licensed Software, and all intellectual property rights associated with, and title thereto, will be the property of NXP.  You agree to assign all, and hereby do assign all rights, title, and interest to any such modifications to the Licensed Software to NXP and agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.  Further, you agree to waive all moral rights relating to your modifications to the Licensed Software, including, without limitation, all rights of identification of authorship and all rights of approval, restriction, or limitation on use or subsequent modification.  Notwithstanding the foregoing, you will have the license rights granted in Section 2 hereto to any such modifications.\n\n5.3.\tOtherwise, you agree to grant an irrevocable, worldwide, and perpetual license to NXP to make, have made, use, sell, offer to sell, import, commercialize, sublicense and reproduce your modifications or derivative works to the Licensed Software without any payment to you. You agree to provide all assistance reasonably requested by NXP to establish, preserve or enforce such right.\n\n6.\tESSENTIAL PATENTS.    NXP has no obligation to identify or obtain any license to any Intellectual Property Right of a third-party that may be necessary for use in connection with technology that is incorporated into the Authorized System (whether or not as part of the Licensed Software).\n\n7.\tTERM AND TERMINATION.   This Agreement will remain in effect unless terminated as provided in this Section.\n\n7.1.\tYou may terminate this Agreement immediately by deleting the Licensed Software and all copies thereof.\n\n7.2.\tEither party may terminate this Agreement if the other party is in default of any of the terms and conditions of this Agreement, and termination is effective if the defaulting party fails to correct such default within 30 days after written notice thereof by the non-defaulting party to the defaulting party at the address below.\n\n7.3.\tNotwithstanding the foregoing, NXP may terminate this Agreement immediately upon written notice if you:  become bankrupt, insolvent, or file a petition for bankruptcy or insolvency; make an assignment for the benefit of its creditors; enter proceedings for winding up or dissolution; are dissolved; or are nationalized or become subject to the expropriation of all or substantially all of your business or assets.\n\n7.4.\tUpon termination of this Agreement, all licenses granted under Section 2 will expire. \n\n7.5.\tAfter termination of this Agreement by either party you will destroy all parts of Licensed Software and its Derivative Works (if any) and will provide to NXP a statement certifying the same.\n\n7.6.\tNotwithstanding the termination of this Agreement for any reason, the terms of Sections 1 and 3 through 24 will survive.  \n\n8.\tSUPPORT.  NXP is not obligated to provide any support, upgrades or new releases of the Licensed Software under this Agreement. If you wish, you may contact NXP and report problems and provide suggestions regarding the Licensed Software. NXP has no obligation to respond to such a problem report or suggestion. NXP may make changes to the Licensed Software at any time, without any obligation to notify or provide updated versions of the Licensed Software to you.\n9.\tNO WARRANTY.  To the maximum extent permitted by law, NXP expressly disclaims any warranty for the Licensed Software. The Licensed Software is provided “AS IS”, without warranty of any kind, either express or implied, including without limitation the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. You assume the entire risk arising out of the use or performance of the licensed software, or any systems you design using the licensed software (if any).\n\n10.\tINDEMNITY. You agree to fully defend and indemnify NXP from all claims, liabilities, and costs (including reasonable attorney’s fees) related to (1) your use (including your subcontractor’s or distributee’s use) of the Licensed Software or (2) your violation of the terms and conditions of this Agreement.\n\n11.\tLIMITATION OF LIABILITY.  EXCLUDING LIABILITY FOR A BREACH OF SECTION 2 (LICENSE GRANTS), SECTION 3 (LICENSE LIMITATIONS AND RESTRICTIONS), OR CLAIMS UNDER SECTION 10 (INDEMNITY), IN NO EVENT WILL EITHER PARTY BE LIABLE, WHETHER IN CONTRACT, TORT, OR OTHERWISE, FOR ANY INCIDENTAL, SPECIAL, INDIRECT, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING, BUT NOT LIMITED TO, DAMAGES FOR ANY LOSS OF USE, LOSS OF TIME, INCONVENIENCE, COMMERCIAL LOSS, OR LOST PROFITS, SAVINGS, OR REVENUES, TO THE FULL EXTENT SUCH MAY BE DISCLAIMED BY LAW. NXP’S TOTAL LIABILITY FOR ALL COSTS, DAMAGES, CLAIMS, OR LOSSES WHATSOEVER ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT OR PRODUCT(S) SUPPLIED UNDER THIS AGREEMENT IS LIMITED TO THE AGGREGATE AMOUNT PAID BY YOU TO NXP IN CONNECTION WITH THE LICENSED SOFTWARE PROVIDED UNDER THIS AGREEMENT TO WHICH LOSSES OR DAMAGES ARE CLAIMED.\n\n12.\tEXPORT COMPLIANCE. \n\n12.1\tEach party shall comply with all applicable export and import control laws and regulations including but not limited to the US Export Administration Regulation (including restrictions on certain military end uses and military end users as specified in Section 15 C.F.R. § 744.21 and prohibited party lists issued by other federal governments), Catch-all regulations and all national and international embargoes. Each party further agrees that it will not knowingly transfer, divert, export or re-export, directly or indirectly, any product, software, including software source code, or technology restricted by such regulations or by other applicable national regulations, received from the other party under this Agreement, or any direct product of such software or technical data to any person, firm, entity, country or destination to which such transfer, diversion, export or re-export is restricted or prohibited, without obtaining prior written authorization from the applicable competent government authorities to the extent required by those laws.\n\n12.2\tProhibition of Export to Russian Federation\n\n(a)\tWith respect to activities that fall under the scope of Article 12g, 12ga of Council Regulation (EU) No 833/2014, or Council Regulation (EU) No 765/2006 (as the case requires), Licensee (a) will not sell, export or re-export, directly or indirectly any item, and (b) will not sell, license or sublicense any intellectual property rights or trade secrets, to the Russian Federation or Belarus, or for use in the Russian Federation or Belarus.\n\n(b)\tLicensee will ensure that the purpose of paragraph (a) above is not frustrated by any third parties further down the commercial chain, including by either resellers, sublicensees, or both.\n\n(c)\tLicensee will set up and maintain an adequate monitoring mechanism to detect conduct by any third parties further down the commercial chain, including by either resellers, sublicensees, or both, that would frustrate the purpose of paragraph (a).\n\n(d)\tAny violation of paragraphs (a), (b) or (c) will constitute a material breach of this Agreement, and NXP will be entitled to seek appropriate remedies, including, but not limited to: (i) termination of this Agreement; (ii) suspension of any of its business relationships with Licensee, Licensee’s affiliates or both, until the breach of paragraph (a) above is remedied, and (iii) a plan to remedy the breach.\n\n(e)\tLicensee will immediately inform NXP about any problems in applying paragraphs (a), (b) or (c), above, including any relevant activities by third parties that could frustrate the purpose of paragraph (a). Licensee will make available to NXP information concerning compliance with the obligations under paragraphs (a), (b) and (c) within 2 weeks of the request for information.\n\n13.\tGOVERNMENT CONTRACT COMPLIANCE\n\n13.1.\tIf you sell Authorized Systems directly to any government or public entity, including U.S., state, local, foreign or international governments or public entities, or indirectly via a prime contractor or subcontractor of such governments or entities, NXP makes no representations, certifications, or warranties whatsoever about compliance with government or public entity acquisition statutes or regulations, including, without limitation, statutes or regulations that may relate to pricing, quality, origin or content.\n\n13.2.\tThe Licensed Software has been developed at private expense and is a “Commercial Item” as defined in 48 C.F.R. Section 2.101, consisting of “Commercial Computer Software”, and/or “Commercial Computer Software Documentation,” as such terms are used in 48 C.F.R. Section 12.212 (or 48 C.F.R. Section 227.7202, as applicable) and may only be licensed to or shared with U.S. Government end users in object code form as part of, or embedded within, Authorized Systems. Any agreement pursuant to which you share the Licensed Software will include a provision that reiterates the limitations of this document and requires all sub-agreements to similarly contain such limitations. \n\n14.\tCRITICAL APPLICATIONS.  In some cases, NXP may promote certain software for use in the development of, or for incorporation into, products or services (a) used in applications requiring fail-safe performance or (b) in which failure could lead to death, personal injury, or severe physical or environmental damage (these products and services are referred to as “Critical Applications”). NXP’s goal is to educate customers so that they can design their own end-product solutions to meet applicable functional safety standards and requirements. Licensee makes the ultimate design decisions regarding its products and is solely responsible for compliance with all legal, regulatory, safety, and security related requirements concerning its products, regardless of any information or support that may be provided by NXP. As such, Licensee assumes all risk related to use of the Licensed Software in Critical Applications and NXP SHALL NOT BE LIABLE FOR ANY SUCH USE IN CRITICAL APPLICATIONS BY LICENSEE. Accordingly, Licensee will indemnify and hold NXP harmless from any claims, liabilities, damages and associated costs and expenses (including attorneys’ fees) that NXP may incur related to Licensee’s incorporation of the Licensed Software in a Critical Application.\n\n15.\tCHOICE OF LAW; VENUE.  This Agreement will be governed by, construed, and enforced in accordance with the laws of The Netherlands, without regard to conflicts of laws principles, will apply to all matters relating to this Agreement or the Licensed Software, and you agree that any litigation will be subject to the exclusive jurisdiction of the courts of Amsterdam, The Netherlands. The United Nations Convention on Contracts for the International Sale of Goods will not apply to this document. \n\n16.\tTRADEMARKS.  You are not authorized to use any NXP trademarks, brand names, or logos.\n\n17.\tENTIRE AGREEMENT.  This Agreement constitutes the entire agreement between you and NXP regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in written form, signed by you and NXP.\n\n\n18.\tSEVERABILITY.  If any provision of this Agreement is held for any reason to be invalid or unenforceable, then the remaining provisions of this Agreement will be unimpaired and, unless a modification or replacement of the invalid or unenforceable provision is further held to deprive you or NXP of a material benefit, in which case the Agreement will immediately terminate, the invalid or unenforceable provision will be replaced with a provision that is valid and enforceable and that comes closest to the intention underlying the invalid or unenforceable provision.\n\n19.\tNO WAIVER.  The waiver by NXP of any breach of any provision of this Agreement will not operate or be construed as a waiver of any other or a subsequent breach of the same or a different provision.\n\n20.\tAUDIT.  You will keep full, clear and accurate records with respect to your compliance with the limited license rights granted under this Agreement for three years following expiration or termination of this Agreement. NXP will have the right, either itself or through an independent certified public accountant to examine and audit, at NXP’s expense, not more than once a year, and during normal business hours, all such records that may bear upon your compliance with the limited license rights granted above. You must make prompt adjustment to compensate for any errors and/or omissions disclosed by such examination or audit.\n\n21.\tNOTICES.  All notices and communications under this Agreement will be made in writing, and will be effective when received at the following addresses: \nNXP:\t\nNXP B.V.\nHigh Tech Campus 60\n5656 AG Eindhoven\nThe Netherlands\nATTN: Legal Department\n \t         \nYou:\t\nThe address of company headquarters will be used for a company Licensee or the address of an individual for an individual Licensee.\n\n22.\tRELATIONSHIP OF THE PARTIES.  The parties are independent contractors. Nothing in this Agreement will be construed to create any partnership, joint venture, or similar relationship. Neither party is authorized to bind the other to any obligations with third parties.\n\n23.\tSUCCESSION AND ASSIGNMENT.   This Agreement will be binding upon and inure to the benefit of the parties and their permitted successors and assigns.  You may not assign this Agreement, or any part of this Agreement, without the prior written approval of NXP, which approval will not be unreasonably withheld or delayed. NXP may assign this Agreement, or any part of this Agreement, in its sole discretion. \n\n24.\tPRIVACY. By agreeing to this Agreement and/or utilizing the Licensed Software, Licensee consents to use of certain personal information, including but not limited to name, email address, and location, for the purpose of NXP’s internal analysis regarding future software offerings.  NXP’s complete Privacy Statement can be found at: https://www.nxp.com/company/our-company/about-nxp/privacy-statement:PRIVACYPRACTICES.\n","name":"LA_OPT_Online Code Hosting NXP_Software_License - v1.4 May 2025"},{"licenseId":"LicenseRef-ee37d4b2-bb57-406b-a1a1-21d411f4725d","extractedText":"Llama 2 Version Release Date: July 18, 2023\n===========================================\n\n\"Agreement\" means the terms and conditions for use, reproduction, distribution\nand modification of the Llama Materials set forth herein.\n\n\"Documentation\" means the specifications, manuals and documentation accompanying\nLlama 2 distributed by Meta at\nai.meta.com/resources/models-and-libraries/llama-downloads/.\n\n\"Licensee\" or \"you\" means you, or your employer or any other person or entity (if\nyou are entering into this Agreement on such person or entity's behalf), of the\nage required under applicable laws, rules or regulations to provide legal consent\nand that has legal authority to bind your employer or such other person or entity\nif you are entering in this Agreement on their behalf.\n\n\"Llama 2\" means the foundational large language models and software and\nalgorithms, including machine-learning model code, trained model weights,\ninference-enabling code, training-enabling code, fine-tuning enabling code and\nother elements of the foregoing distributed by Meta at\nai.meta.com/resources/models-and-libraries/llama-downloads/.\n\n\"Llama Materials\" means, collectively, Meta's proprietary Llama 2 and\nDocumentation (and any portion thereof) made available under this Agreement.\n\n\"Meta\" or \"we\" means Meta Platforms Ireland Limited (if you are located in or, if\nyou are an entity, your principal place of business is in the EEA or Switzerland)\nand Meta Platforms, Inc. (if you are located outside of the EEA or Switzerland).\n\nBy clicking \"I Accept\" below or by using or distributing any portion or element\nof the Llama Materials, you agree to be bound by this Agreement.\n\n  1. License Rights and Redistribution.\n\n      a. Grant of Rights. You are granted a non-exclusive, worldwide,\n        non-transferable and royalty-free limited license under Meta's\n        intellectual property or other rights owned by Meta embodied in the Llama\n        Materials to use, reproduce, distribute, copy, create derivative works\n        of, and make modifications to the Llama Materials.\n\n      b. Redistribution and Use.\n\n          i. If you distribute or make the Llama Materials, or any derivative\n            works thereof, available to a third party, you shall provide a copy\n            of this Agreement to such third party.\n\n          ii. If you receive Llama Materials, or any derivative works thereof,\n            from a Licensee as part of an integrated end user product, then\n            Section 2 of this Agreement will not apply to you.\n\n          iii. You must retain in all copies of the Llama Materials that you\n            distribute the following attribution notice within a \"Notice\" text\n            file distributed as a part of such copies: \"Llama 2 is licensed under\n            the LLAMA 2 Community License, Copyright ÃÂÃ¢ÂÂÃÂÃÂ© Meta\n            Platforms, Inc. All Rights Reserved.\"\n\n          iv. Your use of the Llama Materials must comply with applicable laws\n            and regulations (including trade compliance laws and regulations) and\n            adhere to the Acceptable Use Policy for the Llama Materials\n            (available at https://ai.meta.com/llama/use-policy), which is hereby\n            incorporated by reference into this Agreement.\n\n          v. You will not use the Llama Materials or any output or results of the\n            Llama Materials to improve any other large language model (excluding\n            Llama 2 or derivative works thereof).\n\n  2. Additional Commercial Terms. If, on the Llama 2 version release date, the\n    monthly active users of the products or services made available by or for\n    Licensee, or Licensee's affiliates, is greater than 700 million monthly\n    active users in the preceding calendar month, you must request a license from\n    Meta, which Meta may grant to you in its sole discretion, and you are not\n    authorized to exercise any of the rights under this Agreement unless or until\n    Meta otherwise expressly grants you such rights.\n\n  3. Disclaimer of Warranty. UNLESS REQUIRED BY APPLICABLE LAW, THE LLAMA\n    MATERIALS AND ANY OUTPUT AND RESULTS THEREFROM ARE PROVIDED ON AN \"AS IS\"\n    BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING,\n    WITHOUT LIMITATION, ANY WARRANTIES OF TITLE, NON-INFRINGEMENT,\n    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. YOU ARE SOLELY\n    RESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF USING OR REDISTRIBUTING\n    THE LLAMA MATERIALS AND ASSUME ANY RISKS ASSOCIATED WITH YOUR USE OF THE\n    LLAMA MATERIALS AND ANY OUTPUT AND RESULTS.\n\n  4. Limitation of Liability. IN NO EVENT WILL META OR ITS AFFILIATES BE LIABLE\n    UNDER ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, TORT, NEGLIGENCE,\n    PRODUCTS LIABILITY, OR OTHERWISE, ARISING OUT OF THIS AGREEMENT, FOR ANY LOST\n    PROFITS OR ANY INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL, EXEMPLARY OR\n    PUNITIVE DAMAGES, EVEN IF META OR ITS AFFILIATES HAVE BEEN ADVISED OF THE\n    POSSIBILITY OF ANY OF THE FOREGOING.\n\n  5. Intellectual Property.\n\n      1. No trademark licenses are granted under this Agreement, and in\n        connection with the Llama Materials, neither Meta nor Licensee may use\n        any name or mark owned by or associated with the other or any of its\n        affiliates, except as required for reasonable and customary use in\n        describing and redistributing the Llama Materials.\n\n      2. Subject to Meta's ownership of Llama Materials and derivatives made by\n        or for Meta, with respect to any derivative works and modifications of\n        the Llama Materials that are made by you, as between you and Meta, you\n        are and will be the owner of such derivative works and modifications.\n\n      3. If you institute litigation or other proceedings against Meta or any\n        entity (including a cross-claim or counterclaim in a lawsuit) alleging\n        that the Llama Materials or Llama 2 outputs or results, or any portion of\n        any of the foregoing, constitutes infringement of intellectual property\n        or other rights owned or licensable by you, then any licenses granted to\n        you under this Agreement shall terminate as of the date such litigation\n        or claim is filed or instituted. You will indemnify and hold harmless\n        Meta from and against any claim by any third party arising out of or\n        related to your use or distribution of the Llama Materials.\n\n  6. Term and Termination. The term of this Agreement will commence upon your\n    acceptance of this Agreement or access to the Llama Materials and will\n    continue in full force and effect until terminated in accordance with the\n    terms and conditions herein. Meta may terminate this Agreement if you are in\n    breach of any term or condition of this Agreement. Upon termination of this\n    Agreement, you shall delete and cease use of the Llama Materials. Sections 3,\n    4 and 7 shall survive the termination of this Agreement.\n\n  7. Governing Law and Jurisdiction. This Agreement will be governed and\n    construed under the laws of the State of California without regard to choice\n    of law principles, and the UN Convention on Contracts for the International\n    Sale of Goods does not apply to this Agreement. The courts of California\n    shall have exclusive jurisdiction of any dispute arising out of this\n    Agreement.","name":"Meta Llama 2 Community License Agreement"}],"documentNamespace":"https://blackducksoftware.github.io/spdx/eiq-olive-dc98e1b4-6e0e-4e6a-aaa2-d7c5678bc469","packages":[{"SPDXID":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","downloadLocation":"https://github.com/NXP/eiq-olive","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"ab1014c9-9d1e-4c3f-91f1-c20023b53eef","referenceType":"BlackDuck-Version"}],"filesAnalyzed":false,"licenseConcluded":"(MIT)","licenseDeclared":"(MIT)","name":"eiq-olive","originator":"Organization: NXP","supplier":"Organization: NXP","versionInfo":"0.5"},{"SPDXID":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","downloadLocation":"https://github.com/nxp-imx/ethos-u-vela -b lf-6.6.52-2.2.1","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"4a839f4e-ae87-45c6-bcbc-debf83e93ca1","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"2fbbb246-311c-45f1-b563-bde98f958501","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/nxp-imx/ethos-u-vela","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"ethos-u-vela","originator":"Organization: NXP","supplier":"Organization: NXP","versionInfo":"LF_6.6.52_2.2.1"},{"SPDXID":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"41f60abd-01eb-422b-a4b1-84e6a895c5f3","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"c367dbc5-1645-4c78-bde6-ff5240b1e353","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"licenseConcluded":"LicenseRef-7a1ed882-01c2-4f33-b92a-fe329122044d","licenseDeclared":"LicenseRef-7a1ed882-01c2-4f33-b92a-fe329122044d","name":"Neutron Software","originator":"Organization: Neutron Software","supplier":"Organization: Neutron Software","versionInfo":"neutron-software-2.1.3"},{"SPDXID":"SPDXRef-package-638ac550-d7d7-441e-8fe4-bb6c94c49cc0","downloadLocation":"https://github.com/NXP/eiq-onnx2tflite","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"b4471122-c01b-41a2-9542-ade7ef429eb9","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"638ac550-d7d7-441e-8fe4-bb6c94c49cc0","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/NXP/eiq-onnx2tflite","licenseConcluded":"LicenseRef-babf777f-042b-42df-a5bf-638993427038","licenseDeclared":"LicenseRef-babf777f-042b-42df-a5bf-638993427038","name":"eiq-onnx2tflite","originator":"Organization: NXP","supplier":"Organization: NXP","versionInfo":"0.7"},{"SPDXID":"SPDXRef-package-f189f349-61e4-4a84-b65d-9f4085c506c7","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"f189f349-61e4-4a84-b65d-9f4085c506c7","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"799886d5-edea-4d10-b5b5-3670c9cef8c8","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/huggingface/accelerate","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"accelerate","originator":"Organization: accelerate","supplier":"Organization: accelerate","versionInfo":"1.10.1"},{"SPDXID":"SPDXRef-package-383bd1d4-6962-422c-952c-a93291b3320b","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"a38668d7-cd86-4243-b043-c24a2c5f1f7b","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"383bd1d4-6962-422c-952c-a93291b3320b","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://docs.microsoft.com/python/api/overview/azure/ml/?view=azure-ml-py","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"azure-ai-ml","originator":"Organization: azure-ai-ml","supplier":"Organization: azure-ai-ml","versionInfo":"1.29.0"},{"SPDXID":"SPDXRef-package-635f3fdc-5e46-4f52-bfb7-49af887b4dba","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"635f3fdc-5e46-4f52-bfb7-49af887b4dba","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"fe61f73c-1f8f-4200-9864-e52274c3be7f","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/Azure/azure-sdk-for-python","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"azure-keyvault-secrets","originator":"Organization: azure-keyvault-secrets","supplier":"Organization: azure-keyvault-secrets","versionInfo":"4.10.0"},{"SPDXID":"SPDXRef-package-ea843cac-f342-4163-8c7d-6705eda3fa68","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"ea843cac-f342-4163-8c7d-6705eda3fa68","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"ba0ebe55-411e-4e82-a2c0-b722e8c30705","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://docs.microsoft.com/python/api/overview/azure/ml/?view=azure-ml-py","licenseConcluded":"LicenseRef-3eca8fb9-fca4-4b49-b4bd-189ba8efd691","licenseDeclared":"LicenseRef-3eca8fb9-fca4-4b49-b4bd-189ba8efd691","name":"azureml-fsspec","originator":"Organization: azureml-fsspec","supplier":"Organization: azureml-fsspec","versionInfo":"1.3.1"},{"SPDXID":"SPDXRef-package-19b6c622-c2cf-4d82-965c-a46c34b93053","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"bc4f07f5-2500-42b9-8a70-97cf5fb63823","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"19b6c622-c2cf-4d82-965c-a46c34b93053","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/WindowsAzure/azure-sdk-for-python","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"azure-sdk-for-python","originator":"Organization: azure-sdk-for-python","supplier":"Organization: azure-sdk-for-python","versionInfo":"1.25.0"},{"SPDXID":"SPDXRef-package-7b012973-9445-46ea-9ee4-5f6c69a86be5","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:microsoft:azure_storage_blobs:12.26.0:*:*:*:*:python:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"028c4359-84fc-4f8f-9edf-9c37bc5c61e7","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:azure-storage-blob:12.26.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"7b012973-9445-46ea-9ee4-5f6c69a86be5","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/Azure/azure-storage-python","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"azure-storage-blob","originator":"Organization: azure-storage-blob","supplier":"Organization: azure-storage-blob","versionInfo":"12.26.0"},{"SPDXID":"SPDXRef-package-719f36ee-db45-4c94-ad7a-f587931c3a2d","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"719f36ee-db45-4c94-ad7a-f587931c3a2d","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"ca7fb59a-8cb8-45af-b22d-207b6bb46770","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"http://packages.python.org/bitsandbytes","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"bitsandbytes","originator":"Organization: bitsandbytes","supplier":"Organization: bitsandbytes","versionInfo":"0.47.0"},{"SPDXID":"SPDXRef-package-26454779-7915-45e0-8772-5c33779ca8c5","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"cae2f75c-b165-42de-85fa-56402e0335fa","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"26454779-7915-45e0-8772-5c33779ca8c5","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/tbenthompson/cppimport","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"cppimport","originator":"Organization: cppimport","supplier":"Organization: cppimport","versionInfo":"22.8.2"},{"SPDXID":"SPDXRef-package-92304514-ed87-4583-b336-5cdf1dbbd46c","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"129b3a12-3420-48be-9fb6-03070d68e951","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:docker:docker-py:7.1.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"92304514-ed87-4583-b336-5cdf1dbbd46c","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/dotcloud/docker-py","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"docker-py","originator":"Organization: docker-py","supplier":"Organization: docker-py","versionInfo":"7.1.0"},{"SPDXID":"SPDXRef-package-8b189ed0-e4db-45a1-9021-c4fe377937e0","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:pypi/ethos-u-vela@4.3.0","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"e10a9eaa-7a96-413b-acfe-c49516f211e6","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"b52ff123-fe45-4da3-889a-a19dfbcda692","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"8b189ed0-e4db-45a1-9021-c4fe377937e0","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://git.mlplatform.org/ml/ethos-u/ethos-u-vela.git/","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"ethos-u-vela","originator":"Organization: pypi","supplier":"Organization: pypi","versionInfo":"4.3.0"},{"SPDXID":"SPDXRef-package-acdc6221-d2fa-4176-9f4d-0da3a2b3e81b","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"acdc6221-d2fa-4176-9f4d-0da3a2b3e81b","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"6bec9ddc-e6a7-41f4-844a-5b817c599804","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/facebookresearch/llama","licenseConcluded":"LicenseRef-ee37d4b2-bb57-406b-a1a1-21d411f4725d","licenseDeclared":"NOASSERTION","name":"facebookresearch/llama","originator":"Organization: facebookresearch/llama","supplier":"Organization: facebookresearch/llama","versionInfo":"v2"},{"SPDXID":"SPDXRef-package-8bb28086-fe3c-4651-8b47-58cc1266a45a","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"8bb28086-fe3c-4651-8b47-58cc1266a45a","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"e293dd62-0bec-4701-bb51-485eb34ea963","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/HazyResearch/flash-attention","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"flash-attn","originator":"Organization: flash-attn","supplier":"Organization: flash-attn","versionInfo":"2.8.3"},{"SPDXID":"SPDXRef-package-10f5ab36-ffd4-49fe-b59a-a10d0f0c5a7b","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"ae906881-37fd-4af4-8fe7-e435fd2056af","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:flatbuffers:23.5.26:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:crates_package:flatbuffers:23.5.26:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"10f5ab36-ffd4-49fe-b59a-a10d0f0c5a7b","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:rpm/fedora/flatbuffers-devel@23.5.26-6.fc40?arch=aarch64","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"ec501f67-115f-4b49-9a0e-b74dc782f3e8","referenceType":"BlackDuck-ComponentOrigin"}],"filesAnalyzed":false,"homepage":"http://google.github.io/flatbuffers/","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"FlatBuffers","originator":"Organization: fedora","supplier":"Organization: fedora","versionInfo":"23.5.26"},{"SPDXID":"SPDXRef-package-ea42da12-a79c-4daf-a2fd-3290fee26c5c","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"f5963cf0-186c-47f3-a0e2-1a3376fd4a61","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"ea42da12-a79c-4daf-a2fd-3290fee26c5c","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:rpm/fedora/mingw64-flatbuffers@24.3.25-4.fc41?arch=aarch64","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"ae906881-37fd-4af4-8fe7-e435fd2056af","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:crates_package:flatbuffers:24.3.25:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:flatbuffers:24.3.25:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"http://google.github.io/flatbuffers/","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"FlatBuffers","originator":"Organization: fedora","supplier":"Organization: fedora","versionInfo":"24.3.25"},{"SPDXID":"SPDXRef-package-6821d436-ba5a-4b8c-8ff7-76ba7b660a8b","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"6821d436-ba5a-4b8c-8ff7-76ba7b660a8b","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"78a60ffc-8774-4c3a-8ae2-c826ab82f8c5","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/huggingface/datasets","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"huggingface/datasets","originator":"Organization: huggingface/datasets","supplier":"Organization: huggingface/datasets","versionInfo":"4.0.0"},{"SPDXID":"SPDXRef-package-7712a29d-9128-4cc7-b5b1-874baf733a51","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"7712a29d-9128-4cc7-b5b1-874baf733a51","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"567a9913-e9d7-464c-a3c8-d43a5af32066","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/huggingface/optimum","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"huggingface/optimum","originator":"Organization: huggingface/optimum","supplier":"Organization: huggingface/optimum","versionInfo":"v1.27.0"},{"SPDXID":"SPDXRef-package-dba39ca4-6b3f-4edc-8440-e098008e79db","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"dba39ca4-6b3f-4edc-8440-e098008e79db","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"d0290244-7edb-4c6e-95d2-01eb6589087d","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:intel:neural_compressor:3.5:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"https://github.com/intel/neural-compressor","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"intel/neural-compressor","originator":"Organization: intel/neural-compressor","supplier":"Organization: intel/neural-compressor","versionInfo":"3.5"},{"SPDXID":"SPDXRef-package-25440133-ead8-4ba0-ae72-8ff484dce0e9","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:deb/debian/libflatbuffers-dev@23.5.26%2Bdfsg-1?arch=ppc64el","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"f7b03a64-2ec0-4a25-af9b-6e5ade516210","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"25440133-ead8-4ba0-ae72-8ff484dce0e9","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"c093d39e-e2dd-4183-a3ff-b8ceb793e2f9","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"http://google.github.io/flatbuffers/","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"libflatbuffers-dev","originator":"Organization: debian","supplier":"Organization: debian","versionInfo":"23.5.26"},{"SPDXID":"SPDXRef-package-e2b52686-8bf1-487e-b4ee-d1f52d51ebee","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:github/microsoft/olive@v0.8.0","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"6429a89f-9c14-47d8-bb45-e98a88c334bd","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"e2b52686-8bf1-487e-b4ee-d1f52d51ebee","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"a3657b66-f387-4847-94cc-a2ed42c5f1b3","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"licenseConcluded":"MIT","licenseDeclared":"MIT","name":"microsoft/Olive","originator":"Organization: microsoft","supplier":"Organization: microsoft","versionInfo":"v0.8.0"},{"SPDXID":"SPDXRef-package-a140e417-850e-458e-bf25-089ffe79e894","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"6bfcb4d5-c00c-4071-8173-03b8b1e42aaf","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"a140e417-850e-458e-bf25-089ffe79e894","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/microsoft/onnxscript","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"microsoft/onnxscript","originator":"Organization: microsoft/onnxscript","supplier":"Organization: microsoft/onnxscript","versionInfo":"v0.4.0"},{"SPDXID":"SPDXRef-package-54da7e13-4f3f-46ef-bc53-a4792696a0fc","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"54da7e13-4f3f-46ef-bc53-a4792696a0fc","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"94bea732-25e9-47c9-8f0a-745d93d4c27e","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/openvinotoolkit/nncf_pytorch","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"nncf","originator":"Organization: nncf","supplier":"Organization: nncf","versionInfo":"2.7.0"},{"SPDXID":"SPDXRef-package-a30ac95b-de76-4de1-9655-0369f5dbc799","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:nodejs:nodejs:0.6.20:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:rpm/redhat/nodejs-debuginfo@0.6.20-1.el6op?arch=x86_64","referenceType":"purl"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:joyent:node.js:0.6.20:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:nodejs:node.js:0.6.20:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"9dfe94f1-a461-4ea3-82b7-45068494c208","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"a30ac95b-de76-4de1-9655-0369f5dbc799","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"16d2b56e-9740-4202-ada5-7835ecb0ce41","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:node.js:node.js:0.6.20:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:nodejs:node.js:0.6.20:*:*:*:-:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"https://www.npmjs.org/package/ericapi","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"Node.js","originator":"Organization: redhat","supplier":"Organization: redhat","versionInfo":"v0.6.20"},{"SPDXID":"SPDXRef-package-9d6a468b-5d77-4a33-8975-3b205865bfcc","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"9d6a468b-5d77-4a33-8975-3b205865bfcc","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:numpy:numpy:2.3.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:numpy:2.3.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"4f899c74-a646-4687-a056-3bbcc16bdb04","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://numpy.org/","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"NumPy","originator":"Organization: NumPy","supplier":"Organization: NumPy","versionInfo":"2.3.2"},{"SPDXID":"SPDXRef-package-19023cc7-1888-477a-bc7d-c8ef982837eb","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"a4845a6e-c333-4053-9b60-5bcc14989687","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"19023cc7-1888-477a-bc7d-c8ef982837eb","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/onnx/onnx","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"onnx","originator":"Organization: onnx","supplier":"Organization: onnx","versionInfo":"v1.17.0"},{"SPDXID":"SPDXRef-package-962598ae-45a7-416f-b390-cff7c4579f64","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"962598ae-45a7-416f-b390-cff7c4579f64","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"a4845a6e-c333-4053-9b60-5bcc14989687","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/onnx/onnx","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"onnx","originator":"Organization: onnx","supplier":"Organization: onnx","versionInfo":"v1.9.0"},{"SPDXID":"SPDXRef-package-afa19202-f36e-4eaa-8a97-346f9249d48c","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"afa19202-f36e-4eaa-8a97-346f9249d48c","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"f1bd1807-5ac3-4761-b67a-c2a26db13069","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/NVIDIA","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"onnx-graphsurgeon","originator":"Organization: onnx-graphsurgeon","supplier":"Organization: onnx-graphsurgeon","versionInfo":"0.5.8"},{"SPDXID":"SPDXRef-package-63fd98a4-94ef-4bcb-be50-69788abdbe06","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"63fd98a4-94ef-4bcb-be50-69788abdbe06","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"72ec6b13-e709-4500-a170-eda4a705e796","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://www.onnxruntime.ai","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"onnxruntime","originator":"Organization: onnxruntime","supplier":"Organization: onnxruntime","versionInfo":"1.22.1"},{"SPDXID":"SPDXRef-package-5ad344c1-0a82-453a-a72b-11413e9ca005","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"5ad344c1-0a82-453a-a72b-11413e9ca005","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"a2d6281c-0792-4d33-a6e6-c935ff57ba3f","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://onnxruntime.ai","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"onnxruntime-directml","originator":"Organization: onnxruntime-directml","supplier":"Organization: onnxruntime-directml","versionInfo":"1.22.0"},{"SPDXID":"SPDXRef-package-ed94c576-3c69-44b7-ad97-b0231c37ef49","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"ed94c576-3c69-44b7-ad97-b0231c37ef49","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"0973092e-d6ea-41a2-a885-326ac2637dae","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://onnxruntime.ai","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"onnxruntime-gpu","originator":"Organization: onnxruntime-gpu","supplier":"Organization: onnxruntime-gpu","versionInfo":"1.22.0"},{"SPDXID":"SPDXRef-package-33194fac-bcce-4df4-8ca8-e4b19a32b4c0","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"2c4e8715-c98b-4eba-835d-7b86c1d0c4e1","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"33194fac-bcce-4df4-8ca8-e4b19a32b4c0","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://onnxruntime.ai","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"onnxruntime-qnn","originator":"Organization: onnxruntime-qnn","supplier":"Organization: onnxruntime-qnn","versionInfo":"1.22.2"},{"SPDXID":"SPDXRef-package-60eba154-506d-4734-9193-3044eb0193a9","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"60eba154-506d-4734-9193-3044eb0193a9","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"b1dc9daf-a5c0-4e44-bd6b-eb1e9368d6a5","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:intel:openvino:2025.3.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"https://docs.openvinotoolkit.org/latest/index.html","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"openvino","originator":"Organization: openvino","supplier":"Organization: openvino","versionInfo":"2025.3.0"},{"SPDXID":"SPDXRef-package-f3ec1733-d36c-408b-82a6-39845e87d8be","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"f3ec1733-d36c-408b-82a6-39845e87d8be","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"ebe2ea98-076d-4d8a-a039-2cb83d0719b8","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://optuna.org/","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"optuna","originator":"Organization: optuna","supplier":"Organization: optuna","versionInfo":"4.5.0"},{"SPDXID":"SPDXRef-package-f9467d04-8754-4d6a-ac9e-d77e8a473589","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"f9467d04-8754-4d6a-ac9e-d77e8a473589","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"ff47882f-63de-49d5-850f-35fb11cd4952","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:numfocus:pandas:2.3.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pandas_dev:pandas:2.3.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"https://pandas.pydata.org","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"pandas-python","originator":"Organization: pandas-python","supplier":"Organization: pandas-python","versionInfo":"2.3.2"},{"SPDXID":"SPDXRef-package-b52a9e01-20a4-4438-9a34-8da61b19bfe4","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"da3d6d4c-3ed0-4673-b5ce-90bffc9d4196","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"b52a9e01-20a4-4438-9a34-8da61b19bfe4","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/huggingface/peft","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"peft","originator":"Organization: peft","supplier":"Organization: peft","versionInfo":"0.11.1"},{"SPDXID":"SPDXRef-package-12410182-e8c0-4d7f-bf57-8bb9b34a41c5","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:google-protobuf:3.22.3:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:github_package:google\\/protobuf:3.22.3:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:protobuf-python:3.22.3:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:golang_package:github.com\\/protocolbuffers\\/protobuf:3.22.3:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"1ac59252-efa9-4847-adda-55c704035f0c","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:protobuf-cpp:3.22.3:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"12410182-e8c0-4d7f-bf57-8bb9b34a41c5","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"https://github.com/protocolbuffers/protobuf","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"Protobuf","originator":"Organization: Protobuf","supplier":"Organization: Protobuf","versionInfo":"3.22.3"},{"SPDXID":"SPDXRef-package-58b3ae81-e4ce-46ec-955e-102e68c6f183","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"953dabba-2972-4b92-935d-98629d055b05","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"58b3ae81-e4ce-46ec-955e-102e68c6f183","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:psutil_project:psutil:7.0.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:psutil:7.0.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"http://code.google.com/p/psutil/","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"psutil","originator":"Organization: psutil","supplier":"Organization: psutil","versionInfo":"7.0.0"},{"SPDXID":"SPDXRef-package-8e8965f5-6604-4730-becf-bf7d2db643e1","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"fb09c7e7-862d-43f5-8201-9e2d8c4f4ac2","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"8e8965f5-6604-4730-becf-bf7d2db643e1","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:rpm/opensuse/python310-pybind11@2.11.1-1.5?arch=noarch","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"d04c4a54-3c58-494c-8be8-aa8697895683","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/pybind/pybind11","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"pybind11","originator":"Organization: opensuse","supplier":"Organization: opensuse","versionInfo":"2.11.1"},{"SPDXID":"SPDXRef-package-b30f9a89-299f-4d07-bcfe-8e513e08d534","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"b30f9a89-299f-4d07-bcfe-8e513e08d534","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"d04c4a54-3c58-494c-8be8-aa8697895683","referenceType":"BlackDuck-Component"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:deb/ubuntu/pybind11@2.12.0-1","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"c10061e2-fc48-46c6-9933-fd8bd89221ce","referenceType":"BlackDuck-ComponentOrigin"}],"filesAnalyzed":false,"homepage":"https://github.com/pybind/pybind11","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"pybind11","originator":"Organization: ubuntu","supplier":"Organization: ubuntu","versionInfo":"2.12.0"},{"SPDXID":"SPDXRef-package-42b675c2-e74e-44e7-a348-928e2d5a3516","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"42b675c2-e74e-44e7-a348-928e2d5a3516","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"e2d16045-6cd3-41e0-8817-c3cebbb8618e","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://docs.pydantic.dev","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"pydantic","originator":"Organization: pydantic","supplier":"Organization: pydantic","versionInfo":"v2.9.2"},{"SPDXID":"SPDXRef-package-960c4c5f-d838-4654-ab47-b49903763dcf","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:torch:2.8.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"f5be2292-4ac6-417e-aa35-48c1f3c65c58","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:linuxfoundation:pytorch:2.8.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"960c4c5f-d838-4654-ab47-b49903763dcf","referenceType":"BlackDuck-ComponentVersion"}],"filesAnalyzed":false,"homepage":"http://pytorch.org","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"pytorch","originator":"Organization: pytorch","supplier":"Organization: pytorch","versionInfo":"2.8.0"},{"SPDXID":"SPDXRef-package-4b4c3f0d-9b1c-4892-8d21-b4552167fffa","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"81289d36-4696-46f2-a13c-65ab72661a4d","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"4b4c3f0d-9b1c-4892-8d21-b4552167fffa","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:github/pytorch/glow@45018390b6cb427da6333551bf739476c32aed7f","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"21e30d54-ec63-4983-b647-c23a327e73e8","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/pytorch/glow","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"pytorch-glow","originator":"Organization: pytorch","supplier":"Organization: pytorch","versionInfo":"20230222-snapshot-45018390"},{"SPDXID":"SPDXRef-package-649e9f1a-692e-41d6-8b3d-cd2b6e1b73ab","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"649e9f1a-692e-41d6-8b3d-cd2b6e1b73ab","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"aa28f806-c12b-4255-85a6-f58113141e34","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/pytorch/TensorRT","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"pytorch/TensorRT","originator":"Organization: pytorch/TensorRT","supplier":"Organization: pytorch/TensorRT","versionInfo":"v2.8.0"},{"SPDXID":"SPDXRef-package-aac3a432-d326-48ed-a4ea-760b0ae2472a","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"df6e6bf5-8732-4810-83d8-f40a1939a59f","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pyyaml:pyyaml:6.0.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pyyaml_project:pyyaml:6.0.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:pyyaml:6.0.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"aac3a432-d326-48ed-a4ea-760b0ae2472a","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:redhat_package:python3.11-pyyaml:6.0.2:1.el9pc:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:PyYAML:6.0.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"https://pyyaml.org/","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"PyYAML","originator":"Organization: PyYAML","supplier":"Organization: PyYAML","versionInfo":"6.0.2"},{"SPDXID":"SPDXRef-package-66b45a1a-e336-4cf2-9cf1-2c90468d5b2f","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"66b45a1a-e336-4cf2-9cf1-2c90468d5b2f","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"fde149f6-06d1-44ac-b300-0adabdd0b06c","referenceType":"BlackDuck-Component"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:github/RT-Thread/rt-thread@v4.1.1","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"e28e5cc5-b17a-4310-bd6b-5a128c57cf2f","referenceType":"BlackDuck-ComponentOrigin"}],"filesAnalyzed":false,"homepage":"https://github.com/RT-Thread/rt-thread","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"rt-thread","originator":"Organization: rt-thread","supplier":"Organization: rt-thread","versionInfo":"v4.1.1"},{"SPDXID":"SPDXRef-package-93d8f461-538d-40c4-a8de-8d67854254f7","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"4d279efb-955f-4770-a413-49169f493a75","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:scipy:1.16.1:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"93d8f461-538d-40c4-a8de-8d67854254f7","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:scipy:scipy:1.16.1:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"http://www.scipy.org","licenseConcluded":"BSD-3-Clause","licenseDeclared":"BSD-3-Clause","name":"SciPy","originator":"Organization: SciPy","supplier":"Organization: SciPy","versionInfo":"1.16.1"},{"SPDXID":"SPDXRef-package-708a87ea-956f-4723-a7cc-cd337666cfbc","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:tensorflow:tensorflow:2.15.0:rc0:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.15.0:rc0:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:github/tensorflow/tensorflow@v2.15.0-rc0","referenceType":"purl"},{"referenceCategory":"OTHER","referenceLocator":"19fa5a64-9560-494d-9f72-d2493b17e82a","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"708a87ea-956f-4723-a7cc-cd337666cfbc","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"523a9af4-ec53-46a0-a926-5c8fc16df7a9","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"http://tensorflow.org","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"TensorFlow","originator":"Organization: tensorflow","supplier":"Organization: tensorflow","versionInfo":"2.15.0-rc0"},{"SPDXID":"SPDXRef-package-6a1d9e47-7f1c-4df3-9f6b-3c6a63a13c2f","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"6a1d9e47-7f1c-4df3-9f6b-3c6a63a13c2f","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"523a9af4-ec53-46a0-a926-5c8fc16df7a9","referenceType":"BlackDuck-Component"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:tensorflow:2.18.1:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.18.1:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:tensorflow:tensorflow:2.18.1:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"http://tensorflow.org","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"TensorFlow","originator":"Organization: TensorFlow","supplier":"Organization: TensorFlow","versionInfo":"2.18.1"},{"SPDXID":"SPDXRef-package-16d746cc-5b30-4781-870a-d4d2b4a37ea5","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.4.0:-:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"PACKAGE-MANAGER","referenceLocator":"pkg:github/tensorflow/tensorflow@v2.4.0-rc0","referenceType":"purl"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.4.0:rc0:*:*:-:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.4.0:rc0:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"523a9af4-ec53-46a0-a926-5c8fc16df7a9","referenceType":"BlackDuck-Component"},{"referenceCategory":"OTHER","referenceLocator":"bb8c61bd-6026-4d02-9bc4-db5c8c2b1dd5","referenceType":"BlackDuck-ComponentOrigin"},{"referenceCategory":"OTHER","referenceLocator":"16d746cc-5b30-4781-870a-d4d2b4a37ea5","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.4.0:-:*:*:-:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:google:tensorflow:2.4.0:*:*:*:*:*:*:*","referenceType":"cpe23Type"}],"filesAnalyzed":false,"homepage":"http://tensorflow.org","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"TensorFlow","originator":"Organization: tensorflow","supplier":"Organization: tensorflow","versionInfo":"2.4.0-rc0"},{"SPDXID":"SPDXRef-package-238535d2-3369-4946-acee-071b112af2ff","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"238535d2-3369-4946-acee-071b112af2ff","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"c13de185-faff-4782-aac7-72eeb0fa7aa0","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://lightning.ai/docs/torchmetrics/","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"torchmetrics","originator":"Organization: torchmetrics","supplier":"Organization: torchmetrics","versionInfo":"v1.0.0"},{"SPDXID":"SPDXRef-package-979a272c-cf2e-4907-8558-575bce4a0230","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:huggingface:transformers:4.53.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"979a272c-cf2e-4907-8558-575bce4a0230","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"SECURITY","referenceLocator":"cpe:2.3:a:pypi_package:transformers:4.53.2:*:*:*:*:*:*:*","referenceType":"cpe23Type"},{"referenceCategory":"OTHER","referenceLocator":"0f95cac8-fb0b-469c-978a-aabbd02606ff","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/huggingface/transformers","licenseConcluded":"Apache-2.0","licenseDeclared":"Apache-2.0","name":"transformers","originator":"Organization: transformers","supplier":"Organization: transformers","versionInfo":"4.53.2"},{"SPDXID":"SPDXRef-package-53a9056b-9268-4845-a5bc-34893c3de4b8","downloadLocation":"NOASSERTION","externalRefs":[{"referenceCategory":"OTHER","referenceLocator":"53a9056b-9268-4845-a5bc-34893c3de4b8","referenceType":"BlackDuck-ComponentVersion"},{"referenceCategory":"OTHER","referenceLocator":"b06c2ad1-48c7-4195-9203-ff219a96fb45","referenceType":"BlackDuck-Component"}],"filesAnalyzed":false,"homepage":"https://github.com/openai/triton","licenseConcluded":"MIT","licenseDeclared":"MIT","name":"triton","originator":"Organization: triton","supplier":"Organization: triton","versionInfo":"3.1.0"}],"relationships":[{"spdxElementId":"SPDXRef-DOCUMENT","relationshipType":"DESCRIBES","relatedSpdxElement":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-719f36ee-db45-4c94-ad7a-f587931c3a2d"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-f189f349-61e4-4a84-b65d-9f4085c506c7"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-7b012973-9445-46ea-9ee4-5f6c69a86be5"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-7712a29d-9128-4cc7-b5b1-874baf733a51"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-638ac550-d7d7-441e-8fe4-bb6c94c49cc0"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-8bb28086-fe3c-4651-8b47-58cc1266a45a"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-f3ec1733-d36c-408b-82a6-39845e87d8be"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-53a9056b-9268-4845-a5bc-34893c3de4b8"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-58b3ae81-e4ce-46ec-955e-102e68c6f183"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-960c4c5f-d838-4654-ab47-b49903763dcf"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-9d6a468b-5d77-4a33-8975-3b205865bfcc"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-12410182-e8c0-4d7f-bf57-8bb9b34a41c5"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-60eba154-506d-4734-9193-3044eb0193a9"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-979a272c-cf2e-4907-8558-575bce4a0230"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-ed94c576-3c69-44b7-ad97-b0231c37ef49"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-42b675c2-e74e-44e7-a348-928e2d5a3516"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-33194fac-bcce-4df4-8ca8-e4b19a32b4c0"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-238535d2-3369-4946-acee-071b112af2ff"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-acdc6221-d2fa-4176-9f4d-0da3a2b3e81b"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-6821d436-ba5a-4b8c-8ff7-76ba7b660a8b"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-19b6c622-c2cf-4d82-965c-a46c34b93053"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-54da7e13-4f3f-46ef-bc53-a4792696a0fc"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-e2b52686-8bf1-487e-b4ee-d1f52d51ebee"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-a140e417-850e-458e-bf25-089ffe79e894"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-962598ae-45a7-416f-b390-cff7c4579f64"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-ea843cac-f342-4163-8c7d-6705eda3fa68"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-635f3fdc-5e46-4f52-bfb7-49af887b4dba"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-92304514-ed87-4583-b336-5cdf1dbbd46c"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-aac3a432-d326-48ed-a4ea-760b0ae2472a"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-63fd98a4-94ef-4bcb-be50-69788abdbe06"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-f9467d04-8754-4d6a-ac9e-d77e8a473589"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-b52a9e01-20a4-4438-9a34-8da61b19bfe4"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-afa19202-f36e-4eaa-8a97-346f9249d48c"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-649e9f1a-692e-41d6-8b3d-cd2b6e1b73ab"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-26454779-7915-45e0-8772-5c33779ca8c5"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-383bd1d4-6962-422c-952c-a93291b3320b"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-dba39ca4-6b3f-4edc-8440-e098008e79db"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-93d8f461-538d-40c4-a8de-8d67854254f7"},{"spdxElementId":"SPDXRef-package-ab1014c9-9d1e-4c3f-91f1-c20023b53eef","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-5ad344c1-0a82-453a-a72b-11413e9ca005"},{"spdxElementId":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-8e8965f5-6604-4730-becf-bf7d2db643e1"},{"spdxElementId":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-10f5ab36-ffd4-49fe-b59a-a10d0f0c5a7b"},{"spdxElementId":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-25440133-ead8-4ba0-ae72-8ff484dce0e9"},{"spdxElementId":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-8b189ed0-e4db-45a1-9021-c4fe377937e0"},{"spdxElementId":"SPDXRef-package-4a839f4e-ae87-45c6-bcbc-debf83e93ca1","relationshipType":"DYNAMIC_LINK","relatedSpdxElement":"SPDXRef-package-ea42da12-a79c-4daf-a2fd-3290fee26c5c"},{"spdxElementId":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-708a87ea-956f-4723-a7cc-cd337666cfbc"},{"spdxElementId":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-66b45a1a-e336-4cf2-9cf1-2c90468d5b2f"},{"spdxElementId":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-4b4c3f0d-9b1c-4892-8d21-b4552167fffa"},{"spdxElementId":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-a30ac95b-de76-4de1-9655-0369f5dbc799"},{"spdxElementId":"SPDXRef-package-41f60abd-01eb-422b-a4b1-84e6a895c5f3","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-16d746cc-5b30-4781-870a-d4d2b4a37ea5"},{"spdxElementId":"SPDXRef-package-638ac550-d7d7-441e-8fe4-bb6c94c49cc0","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-19023cc7-1888-477a-bc7d-c8ef982837eb"},{"spdxElementId":"SPDXRef-package-638ac550-d7d7-441e-8fe4-bb6c94c49cc0","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-b30f9a89-299f-4d07-bcfe-8e513e08d534"},{"spdxElementId":"SPDXRef-package-638ac550-d7d7-441e-8fe4-bb6c94c49cc0","relationshipType":"CONTAINS","relatedSpdxElement":"SPDXRef-package-6a1d9e47-7f1c-4df3-9f6b-3c6a63a13c2f"}]}